{
  "items": [
    {
      "id": "NixcAAAAQAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/NixcAAAAQAAJ",
      "title": "Reports from Commissioners",
      "author": "Great Britain. Parliament. House of Commons",
      "category": "classics",
      "description": "Reports from Commissioners",
      "thumbnail": "http://books.google.com/books/content?id=NixcAAAAQAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": "http://books.google.com.eg/books/download/Reports_from_Commissioners.epub?id=NixcAAAAQAAJ&hl=&output=epub&source=gbs_api",
      "previewLink": "http://books.google.com.eg/books?id=NixcAAAAQAAJ&pg=RA1-PA136&dq=classics+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "R1FiDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/R1FiDwAAQBAJ",
      "title": "Forward with Classics",
      "author": "Arlene Holmes-Henderson",
      "category": "classics",
      "description": "Despite their removal from England's National Curriculum in 1988, and claims of elitism, Latin and Greek are increasingly re-entering the 'mainstream' educational arena. Since 2012, there have been more students in state-maintained schools in England studying classical subjects than in independent schools, and the number of schools offering Classics continues to rise in the state-maintained sector. The teaching and learning of Latin and Greek is not, however, confined to the classroom: community-based learning for adults and children is facilitated in newly established regional Classics hubs in evenings and at weekends, in universities as part of outreach, and even in parks and in prisons. This book investigates the motivations of teachers and learners behind the rise of Classics in the classroom and in communities, and explores ways in which knowledge of classical languages is considered valuable for diverse learners in the 21st century. The role of classical languages within the English educational policy landscape is examined, as new possibilities exist for introducing Latin and Greek into school curricula. The state of Classics education internationally is also investigated, with case studies presenting the status quo in policy and practice from Australasia, North America, the rest of Europe and worldwide. The priorities for the future of Classics education in these diverse locations are compared and contrasted by the editors, who conjecture what strategies are conducive to success.",
      "thumbnail": "http://books.google.com/books/content?id=R1FiDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=R1FiDwAAQBAJ&pg=PT268&dq=classics+insubject&hl=&cd=2&source=gbs_api"
    },
    {
      "id": "-XsSBwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/-XsSBwAAQBAJ",
      "title": "Oxford Classics",
      "author": "Christopher Stary",
      "category": "classics",
      "description": "Oxford, the home of lost causes, the epitome of the world of medieval and renaissance learning in Britain, has always fascinated at a variety of levels: social, institutional, cultural. Its rival, Cambridge, was long dominated by mathematics, while Oxford's leading study was Classics. In this pioneering book, 16 leading authorities explore a variety of aspects of Oxford Classics in the last two hundred years: curriculum, teaching and learning, scholarly style, publishing, gender and social exclusion and the impact of German scholarship. Greats (Literae Humaniores) is the most celebrated classical course in the world: here its early days in the mid-19th century and its reform in the late 20th are discussed, in the latter case by those intimately involved with the reforms. An opening chapter sets the scene by comparing Oxford with Cambridge Classics, and several old favourites are revisited, including such familiar Oxford products as Liddell and Scott's \"Greek-English Lexicon\", the \"Oxford Classical Texts\", and Zimmern's \"Greek Commonwealth\". The book as a whole offers a pioneering, wide-ranging survey of Classics in Oxford.",
      "thumbnail": "http://books.google.com/books/content?id=-XsSBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=-XsSBwAAQBAJ&pg=PA4&dq=classics+insubject&hl=&cd=3&source=gbs_api"
    },
    {
      "id": "hvoEw0eT5nIC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/hvoEw0eT5nIC",
      "title": "Contextualizing Classics",
      "author": "John Peradotto",
      "category": "classics",
      "description": "This collection of original essays examines innovations in both the theory and practice of classical philology. The chapters address interdisciplinary methods in a variety of ways. Some apply theoretical insights derived from other disciplines, such as folklore studies, performance theory, feminist criticism, and the like, to classical texts. Others examine the relationships between classics and cultural studies, popular literature, film, art history, and other related disciplines. Others, again, look to the evolution of theoretical methods within the discipline of classics. Taken together, the essays offer a spectrum of new approaches in the classics and their place within the profession.",
      "thumbnail": "http://books.google.com/books/content?id=hvoEw0eT5nIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=hvoEw0eT5nIC&pg=PA343&dq=classics+insubject&hl=&cd=4&source=gbs_api"
    },
    {
      "id": "7_ddt_LSl_wC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/7_ddt_LSl_wC",
      "title": "Classics in Progress",
      "author": "Timothy Peter Wiseman",
      "category": "classics",
      "description": "The study of Greco-Roman civilisation is as exciting and innovative today as it has ever been. This intriguing collection of essays by contemporary classicists reveals new discoveries, new interpretations and new ways of exploring the experiences of the ancient world. Through one and a half millennia of literature, politics, philosophy, law, religion and art, the classical world formed the origin of western culture and thought. This book emphasises the many ways in which it continues to engage with contemporary life. Offering a wide variety of authorial style, the chapters range in subject matter from contemporary poets' exploitation of Greek and Latin authors, via newly discovered literary texts and art works, to modern arguments about ancient democracy and slavery, and close readings of the great poets and philosophers of antiquity. This engaging book reflects the current rejuvenation of classical studies and will fascinate anyone with an interest in western history.",
      "thumbnail": "http://books.google.com/books/content?id=7_ddt_LSl_wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=7_ddt_LSl_wC&pg=PT7&dq=classics+insubject&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "Rd3U9Qw9zYIC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/Rd3U9Qw9zYIC",
      "title": "Hollywood Classics 2",
      "author": "John Reid",
      "category": "classics",
      "description": "What makes a \"B\" movie? This survey examines a hundred typical \"B\" movies (with complete cast and credit details)from Hollywood's Golden Age, including good movies (\"Charlie Chan at Treasure Island\", bad movies (\"Dangerous Cargo\") and cult movies (\"Abbott and Costello Meet Dr Jekyll and Mr Hyde\").",
      "thumbnail": "http://books.google.com/books/content?id=Rd3U9Qw9zYIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=Rd3U9Qw9zYIC&pg=PA67&dq=classics+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "gnNoAgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/gnNoAgAAQBAJ",
      "title": "Classics in the Modern World",
      "author": "Lorna Hardwick",
      "category": "classics",
      "description": "Classics in the Modern World brings together a collection of distinguished international contributors to discuss the features and implications of a 'democratic turn' in modern perceptions of ancient Greece and Rome. It examines how Greek and Roman material has been involved with issues of democracy, both in political culture and in the greater diffusion of classics in recent times outside the elite classes. By looking at individual case studies from theatre, film, fiction, TV, radio, museums, and popular media, and through area studies that consider trends over time in particular societies, the volume explores the relationship between Greek and Roman ways of thinking and modern definitions of democratic practices and approaches, enabling a wider re-evaluation of the role of ancient Greece and Rome in the modern world.",
      "thumbnail": "http://books.google.com/books/content?id=gnNoAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=gnNoAgAAQBAJ&pg=PA27&dq=classics+insubject&hl=&cd=10&source=gbs_api"
    },
    {
      "id": "ZFOODQAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/ZFOODQAAQBAJ",
      "title": "Classics for the Masses",
      "author": "Pauline Fairclough",
      "category": "classics",
      "description": "Musicologist Pauline Fairclough explores the evolving role of music in shaping the cultural identity of the Soviet Union in a revelatory work that counters certain hitherto accepted views of an unbending, unchanging state policy of repression, censorship, and dissonance that existed in all areas of Soviet artistic endeavor. Newly opened archives from the Leninist and Stalinist eras have shed new light on Soviet concert life, demonstrating how the music of the past was used to help mold and deliver cultural policy, how “undesirable” repertoire was weeded out during the 1920s, and how Russian and non-Russian composers such as Mozart, Tchaikovsky, Wagner, Bach, and Rachmaninov were “canonized” during different, distinct periods in Stalinist culture. Fairclough’s fascinating study of the ever-shifting Soviet musical-political landscape identifies 1937 as the start of a cultural Cold War, rather than occurring post-World War Two, as is often maintained, while documenting the efforts of musicians and bureaucrats during this period to keep musical channels open between Russia and the West.",
      "thumbnail": "http://books.google.com/books/content?id=ZFOODQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=ZFOODQAAQBAJ&pg=PA121&dq=classics+insubject&hl=&cd=11&source=gbs_api"
    },
    {
      "id": "Ef0GBgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/Ef0GBgAAQBAJ",
      "title": "Classical Traditions in Science Fiction",
      "author": "Brett M. Rogers",
      "category": "classics",
      "description": "For all its concern with change in the present and future, science fiction is deeply rooted in the past and, surprisingly, engages especially deeply with the ancient world. Indeed, both as an area in which the meaning of \"classics\" is actively transformed and as an open-ended set of texts whose own 'classic' status is a matter of ongoing debate, science fiction reveals much about the roles played by ancient classics in modern times. Classical Traditions in Science Fiction is the first collection in English dedicated to the study of science fiction as a site of classical receptions, offering a much-needed mapping of that important cultural and intellectual terrain. This volume discusses a wide variety of representative examples from both classical antiquity and the past four hundred years of science fiction, beginning with science fiction's \"rosy-fingered dawn\" and moving toward the other-worldly literature of the present day. As it makes its way through the eras of science fiction, Classical Traditions in Science Fiction exposes the many levels on which science fiction engages the ideas of the ancient world, from minute matters of language and structure to the larger thematic and philosophical concerns.",
      "thumbnail": "http://books.google.com/books/content?id=Ef0GBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=Ef0GBgAAQBAJ&pg=PT25&dq=classics+insubject&hl=&cd=12&source=gbs_api"
    },
    {
      "id": "GKHWDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/GKHWDwAAQBAJ",
      "title": "A Mummer’s Wife by George Moore - Delphi Classics (Illustrated)",
      "author": "George Moore",
      "category": "classics",
      "description": "This eBook features the unabridged text of ‘A Mummer’s Wife by George Moore - Delphi Classics (Illustrated)’ from the bestselling edition of ‘The Complete Works of George Moore’. Having established their name as the leading publisher of classic literature and art, Delphi Classics produce publications that are individually crafted with superior formatting, while introducing many rare texts for the first time in digital print. The Delphi Classics edition of Moore includes original annotations and illustrations relating to the life and works of the author, as well as individual tables of contents, allowing you to navigate eBooks quickly and easily. eBook features: * The complete unabridged text of ‘A Mummer’s Wife by George Moore - Delphi Classics (Illustrated)’ * Beautifully illustrated with images related to Moore’s works * Individual contents table, allowing easy navigation around the eBook * Excellent formatting of the textPlease visit www.delphiclassics.com to learn more about our wide range of titles",
      "thumbnail": "http://books.google.com/books/content?id=GKHWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=GKHWDwAAQBAJ&pg=PT424&dq=classics+insubject&hl=&cd=13&source=gbs_api"
    }
  ]
}