{
  "items": [
    {
      "id": "xMLTDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/xMLTDwAAQBAJ",
      "title": "Maximizing the Impact of Comics in Your Library: Graphic Novels, Manga, and More",
      "author": "Jack Phoenix",
      "category": "comics",
      "description": "This unique guide offers fresh insights on how graphic novels and comics differ from traditional books and require different treatment in the library—from purchasing, shelving, and cataloging to readers' advisory services, programs, and curriculum. Challenging librarians to rethink some of their traditional practices, Maximizing the Impact of Comics in Your Library provides creative and proven solutions for libraries of all types that want to get comics into the hands of fans and promote readership. The author describes how libraries would benefit from an in-house classification system and organization that accounts for both publishers and series. In addition, acquiring comics can often be tricky due to renumbering of series, reboots, shifting creative teams, and more—this book shows you how to work around those obstacles. Shelving and displays that reflect comic readers' browsing habits, creative programs that boost circulation of comics and graphic novels, and how comics can play a vital role in educational institutions are also covered. • Addresses common challenges librarians face with comics and graphic novels collections, and shows how to surmount them • Offers a solutions-focused approach • Describes how comics can be used to better engage your community and to educate youth • Fills a gap in the professional literature, covering topics not touched upon in the existing literature • Serves as a vital resource for public, academic, and school libraries",
      "thumbnail": "http://books.google.com/books/content?id=xMLTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=xMLTDwAAQBAJ&pg=PA70&dq=comics+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "Jn4qwJ7LdMUC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/Jn4qwJ7LdMUC",
      "title": "Comic Books",
      "author": "Shirrel Rhoades",
      "category": "comics",
      "description": "This book is an insider's guide to how the comic book industry works. You'll learn how comic book superheroes are created and the deeper meanings they represent. You'll follow the development of sequential art storytelling - from caveman wall paintings to modern manga and cinematic techniques. Here you will explore comics in all forms: those flimsy pamphlets we call comic books; thick graphic novels; Japanese manga; and blockbuster movies featuring epic battles between good and evil. But behind it all, you'll discover how comics are an intellectual property business, the real money found in licensed bedsheets and fast-food merchandise, heart-pounding theme park rides and collectible toys, video games, and Hollywood extravaganza featuring such popular superheroes as Spider-Man, Superman, X-Men, and Batman.",
      "thumbnail": "http://books.google.com/books/content?id=Jn4qwJ7LdMUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=Jn4qwJ7LdMUC&pg=PA43&dq=comics+insubject&hl=&cd=2&source=gbs_api"
    },
    {
      "id": "gZlTAQAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/gZlTAQAAQBAJ",
      "title": "Adult Comics",
      "author": "Roger Sabin",
      "category": "comics",
      "description": "In a society where a comic equates with knockabout amusment for children, the sudden pre-eminence of adult comics, on everything from political satire to erotic fantasy, has predictably attracted an enormous amount of attention. Adult comics are part of the cultural landscape in a way that would have been unimaginable a decade ago. In this first survey of its kind, Roger Sabin traces the history of comics for older readers from the end of the nineteenth century to the present. He takes in the pioneering titles pre-First World War, the underground 'comix' of the 1960s and 1970s, 'fandom' in the 1970s and 1980s, and the boom of the 1980s and 1990s (including 'graphic novels' and Viz.). Covering comics from the United States, Europe and Japan, Adult Comics addresses such issues as the graphic novel in context, cultural overspill and the role of women. By taking a broad sweep, Sabin demonstrates that the widely-held notion that comics 'grew up' in the late 1980s is a mistaken one, largely invented by the media. Adult Comics: An Introduction is intended primarily for student use, but is written with the comic enthusiast very much in mind.",
      "thumbnail": "http://books.google.com/books/content?id=gZlTAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=gZlTAQAAQBAJ&pg=PT94&dq=comics+insubject&hl=&cd=3&source=gbs_api"
    },
    {
      "id": "3ZnyAAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/3ZnyAAAAQBAJ",
      "title": "Chester Brown Conversations",
      "author": "Chester Brown",
      "category": "comics",
      "description": "The early 1980s saw a revolution in mainstream comics--in subject matter, artistic integrity, and creators' rights--as new methods of publishing and distribution broadened the possibilities. Among those artists utilizing these new methods, Chester Brown (b. 1960) quickly developed a cult following due to the undeniable quality and originality of his Yummy Fur (1983-1994). Chester Brown: Conversations collects interviews covering all facets of the cartoonist's long career and includes several pieces from now-defunct periodicals and fanzines. Brown was among a new generation of artists whose work dealt with decidedly nonmainstream subjects. By the 1980s comics were, to quote a by-now well-worn phrase, \"not just for kids anymore,\" and subsequent censorious attacks by parents concerned about the more salacious material being published by the major publishers--subjects that routinely included adult language, realistic violence, drug use, and sexual content--began to roil the industry. Yummy Fur came of age during this storm and its often-offensive content, including dismembered, talking penises, led to controversy and censorship. With Brown's highly unconventional adaptations of the Gospels, and such comics memoirs as The Playboy (1991/1992) and I Never Liked You (1991-1994), Brown gradually moved away from the surrealistic, humor oriented strips toward autobiographical material far more restrained and elegiac in tone than his earlier strips. This work was followed by Louis Riel (1999-2003), Brown's critically acclaimed comic book biography of the controversial nineteenth-century Canadian revolutionary, and Paying for It (2011), his best-selling memoir on the life of a john.",
      "thumbnail": "http://books.google.com/books/content?id=3ZnyAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=3ZnyAAAAQBAJ&printsec=frontcover&dq=comics+insubject&hl=&cd=4&source=gbs_api"
    },
    {
      "id": "RnB24eM-xcMC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/RnB24eM-xcMC",
      "title": "Boys in Children's Literature and Popular Culture",
      "author": "Annette Wannamaker",
      "category": "comics",
      "description": "Boys in Children’s Literature and Popular Culture proposes new theoretical frameworks for understanding the contradictory ways masculinity is represented in popular texts consumed by boys in the United States. The popular texts boys like are often ignored by educators and scholars, or are simply dismissed as garbage that boys should be discouraged from enjoying. However, examining and making visible the ways masculinity functions in these texts is vital to understanding the broad array of works that make up children’s culture and form dominant versions of masculinity. Such popular texts as Harry Potter, Captain Underpants, and Japanese manga and anime often perform rituals of subject formation in overtly grotesque ways that repulse adult readers and attract boys. They often use depictions of the abject – threats to bodily borders – to blur the distinctions between what is outside the body and what is inside, between what is \"I\" and what is \"not I.\" Because of their reliance on depictions of the abject, those popular texts that most vigorously perform exaggerated versions of masculinity also create opportunities to make dominant masculinity visible as a social construct.",
      "thumbnail": "http://books.google.com/books/content?id=RnB24eM-xcMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=RnB24eM-xcMC&pg=PA107&dq=comics+insubject&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "OhdIAwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/OhdIAwAAQBAJ",
      "title": "Reading Comics",
      "author": "Mila Bongco",
      "category": "comics",
      "description": "First published in 2000. Routledge is an imprint of Taylor & Francis, an informa company.",
      "thumbnail": "http://books.google.com/books/content?id=OhdIAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=OhdIAwAAQBAJ&pg=PA16&dq=comics+insubject&hl=&cd=6&source=gbs_api"
    },
    {
      "id": "JYwHEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/JYwHEAAAQBAJ",
      "title": "Spanish Comics",
      "author": "Anne Magnussen",
      "category": "comics",
      "description": "Spanish comics represent an exciting and diverse field, yet one that is often overlooked outside of Spain. Spanish Comics offers an overview on contemporary scholarship on Spanish comics, focusing on a wide range of comics dating from the Francoist dictatorship, 1939-1975; the Political Transition, 1970-1985; and Democratic Spain since the early 1980s including the emergence of the graphic novel in 2000. Touching on themes of memory, gender, regional identities, and history, the chapters in this collection demonstrate the historical and cultural significance of Spanish comics.",
      "thumbnail": "http://books.google.com/books/content?id=JYwHEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=JYwHEAAAQBAJ&pg=PA210&dq=comics+insubject&hl=&cd=7&source=gbs_api"
    },
    {
      "id": "epc9EAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/epc9EAAAQBAJ",
      "title": "Handbook of Comics and Graphic Narratives",
      "author": "Sebastian Domsch",
      "category": "comics",
      "description": "Whether one describes them as sequential art, graphic narratives or graphic novels, comics have become a vital part of contemporary culture. Their range of expression contains a tremendous variety of forms, genres and modes − from high to low, from serial entertainment for children to complex works of art. This has led to a growing interest in comics as a field of scholarly analysis, as comics studies has established itself as a major branch of criticism. This handbook combines a systematic survey of theories and concepts developed in the field alongside an overview of the most important contexts and themes and a wealth of close readings of seminal works and authors. It will prove to be an indispensable handbook for a large readership, ranging from researchers and instructors to students and anyone else with a general interest in this fascinating medium.",
      "thumbnail": "http://books.google.com/books/content?id=epc9EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=epc9EAAAQBAJ&pg=PA17&dq=comics+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "AvMTEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/AvMTEAAAQBAJ",
      "title": "Postcolonialism and Migration in French Comics",
      "author": "Mark McKinney",
      "category": "comics",
      "description": "Profound analysis of French comics through a postcolonial lens Postcolonialism and migration are major themes in contemporary French comics and have roots in the Algerian War (1954–62), antiracist struggle, and mass migration to France. This volume studies comics from the end of the formal dismantling of French colonial empire in 1962 up to the present. French cartoonists of ethnic-minority and immigrant heritage are a major focus, including Zeina Abirached (Lebanon), Yvan Alagbé (Benin), Baru (Italy), Enki Bilal (former Yugoslavia), Farid Boudjellal (Algeria and Armenia), José Jover (Spain), Larbi Mechkour (Algeria), and Roland Monpierre (Guadeloupe). The author analyzes comics representing a gamut of perspectives on immigration and postcolonial ethnic minorities, ranging from staunch defense to violent rejection. Individual chapters are dedicated to specific artists, artistic collectives, comics, or themes, including avant-gardism, undocumented migrants in comics, and racism in far-right comics.",
      "thumbnail": "http://books.google.com/books/content?id=AvMTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=AvMTEAAAQBAJ&pg=PA101&dq=comics+insubject&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "nj02doLM968C",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/nj02doLM968C",
      "title": "Heritage Comics Auctions",
      "author": "Ivy Press",
      "category": "comics",
      "description": "Heritage Comics Auctions #815 Pini Collection Catalog",
      "thumbnail": "http://books.google.com/books/content?id=nj02doLM968C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=nj02doLM968C&pg=PA25&dq=comics+insubject&hl=&cd=10&source=gbs_api"
    }
  ]
}