{
  "items": [
    {
      "id": "3zCIDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/3zCIDwAAQBAJ",
      "title": "A Complete Book on Data Interpretation & Data Analysis (eBook)",
      "author": "Adda247 Publications",
      "category": "ebook",
      "description": "-2000+ Questions Based on Latest Pattern with detailed Solutions -Covers all the types of DI such as Table| Pie | Bar | Line | Caselet |Radar -Includes Arithmetic Based & Missing DI asked in IBPS/SBI Mains Examinations -Includes Previous year questions asked in SBI Po mains 2018, IBPS PO mains 2018 and other exams. -Essential for both Prelims and Mains exams A Complete Book on Data Interpretation and Analysis eBook’ is an effort to assist all the government job aspirants with a comprehensive, reliable and satisfactory source of offline practice materials to improve their proficiency in Quantitative Aptitude. This ebook is a unique approach towards fulfilling the needs of our dedicated aspirants who wish to clear any obstacle with ease. We should never be confined by the limits of our brain and this eBook which is thoroughly revised and covers every crucial aspect of all the Banking and Insurance examinations assures you that it will help you in transcending your limits. The ebook comprises more than 300 DIs which include 2000+ Questions covering all the patterns and topics that the IBPS, SBI and other banking exams have been surprising us with for last few years. The ebook is elegantly divided into different chapters namely Table, Bar Graph, Line Graph, Pie Graph, Mixed Graph, Arithmetic and Caselets. Each chapter is further categorized into four parts – Solved Examples, Previous years’ exercises, Level 1 exercise (Basic to Moderate) and Level 2 exercise (Advance). There are new methods and approach to solving the latest pattern questions within a short time limit. Detailed solutions are provided to every question for better CONCEPTUAL learning. In the second edition, we have includes more than 500 Questions based on latest pattern and questions asked in recent exams like SBI PO 2018, IBPS PO 2018, RRB PO 2018 and other exams. The questions are duly framed and prepared by our best faculties in this field. While preparing, all the necessities including minute details have been taken care of. The questions are preferably selected based on their quality, inculcating different levels and types that are being asked in the banking and insurance examinations. The ebook will be extremely helpful in preparing for all the Banking and Insurance examinations like IBPS PO, SBI PO, BANK OF BARODA PO, SYNDICATE BANK PO, RBI ASSISTANT, OICL, UIIC, etc.",
      "thumbnail": "http://books.google.com/books/content?id=3zCIDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=3zCIDwAAQBAJ&pg=PA303&dq=ebooks+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "4sovEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/4sovEAAAQBAJ",
      "title": "EBOOK: Doing Social Research: A Global Context",
      "author": "Claire Wagner",
      "category": "ebook",
      "description": "With its focus on critical thinking and applied learning, Doing Social Research provides a unique approach to conducting social research. The book is organised according to the broad chronology of developing and conducting a typical student research project and provides coverage of key theories alongside exercises, case studies and scenarios.Written specifically for students in South Africa and the developing world and drawing on examples from a range of fields in the social sciences, the book brings research methods to life.",
      "thumbnail": "http://books.google.com/books/content?id=4sovEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=4sovEAAAQBAJ&pg=PA38&dq=ebooks+insubject&hl=&cd=2&source=gbs_api"
    },
    {
      "id": "JNNEBgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/JNNEBgAAQBAJ",
      "title": "EBOOK: Rethinking Single Sex Teaching",
      "author": "Gabrielle Ivinson",
      "category": "ebook",
      "description": "The retreat to single-sex classes in co-educational comprehensive schools in the UK reflects a long history where educational policy and practice has made explicit the belief that boys and girls are different in how they learn and what they should learn. However, there is also a common assumption that there is equality in what is made available to learn and, if there is not, then single-sex organisation achieves this. The authors challenge this opinion and offer a fresh and theoretically informed look at the debate about single-sex teaching, presenting insights from research about the intended and unintended consequences of gender division in schools. Drawing on classroom observations and in-depth interviews with teachers and students, the book illustrates the effect of single-sex classrooms on learners and on the versions of subject knowledge made available to them. In exploring the differences in teaching practices between boys’ and girls’ classrooms, in relation to subjects such as Science, English, Drama, and Design and Technology, the authors highlight how single-sex teaching can, inadvertently, create circumstances which limit rather than open up students’ access to subject knowledge. The authors offer conceptual tools for investigating the knowledge-gender dynamic, advocating that learning will expand if teachers work with gender to help students to cross boundaries into non-traditional gender territories within subject lessons. Rethinking Single-Sex Teaching is thought-provoking reading for teachers, head teachers, academics and policy makers.",
      "thumbnail": "http://books.google.com/books/content?id=JNNEBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=JNNEBgAAQBAJ&pg=PA10&dq=ebooks+insubject&hl=&cd=3&source=gbs_api"
    },
    {
      "id": "9HWUOPO0iqkC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/9HWUOPO0iqkC",
      "title": "The Ebook Revolution",
      "author": "Kate Sheehan",
      "category": "ebook",
      "description": "The book ecosystem is radically changing, and libraries must change with it. This book tackles the controversial discussion about eBooks and explores librarian-driven solutions and visions for the future of libraries in the 21st century.",
      "thumbnail": "http://books.google.com/books/content?id=9HWUOPO0iqkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=9HWUOPO0iqkC&pg=PA42&dq=ebooks+insubject&hl=&cd=4&source=gbs_api"
    },
    {
      "id": "HtMsBgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/HtMsBgAAQBAJ",
      "title": "Managing eBook Metadata in Academic Libraries",
      "author": "Donna E Frederick",
      "category": "ebook",
      "description": "Managing ebook Metadata in Academic Libraries: Taming the Tiger tackles the topic of ebooks in academic libraries, a trend that has been welcomed by students, faculty, researchers, and library staff. However, at the same time, the reality of acquiring ebooks, making them discoverable, and managing them presents library staff with many new challenges. Traditional methods of cataloging and managing library resources are no longer relevant where the purchasing of ebooks in packages and demand driven acquisitions are the predominant models for acquiring new content. Most academic libraries have a complex metadata environment wherein multiple systems draw upon the same metadata for different purposes. This complexity makes the need for standards-based interoperable metadata more important than ever. In addition to complexity, the nature of the metadata environment itself typically varies slightly from library to library making it difficult to recommend a single set of practices and procedures which would be relevant to, and effective in, all academic libraries. Considering all of these factors together, it is not surprising when academic libraries find it difficult to create and manage the metadata for their ebook collections. This book is written as a guide for metadata librarians, other technical services librarians, and ancillary library staff who manage ebook collections to help them understand the requirements for ebook metadata in their specific library context, to create a vision for ebook metadata management, and to develop a plan which addresses the relevant issues in metadata management at all stages of the lifecycle of ebooks in academic libraries from selection, to deselection or preservation. Explores the reasons behind creating records for our resources and challenges libraries to think about what that means for their context Discusses the complex nature of academic libraries and the electronic resources they require Encourages librarians to find their own way to manage metadata",
      "thumbnail": "http://books.google.com/books/content?id=HtMsBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=HtMsBgAAQBAJ&pg=PA235&dq=ebooks+insubject&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "sjYcyLxsERYC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/sjYcyLxsERYC",
      "title": "EBOOK: Beginning Primary Teaching",
      "author": "Angela Jacklin",
      "category": "ebook",
      "description": "Beginning Primary Teaching supports primary teachers' early professional development and learning, tackling key questions and concerns that new teachers might face in their early careers, such as: How will I get through the first term? When will I feel like a ‘real’ teacher? What can I expect from my first years in teaching? Drawing on the experiences of beginning primary teachers themselves, this is an authentic account of their crucial early teaching experiences, challenges and achievements. As well as providing a research-based context, the book is firmly grounded in the day-to-day practices of education professionals working with young people in schools, and offers valuable practical guidance for new teachers. By illustrating and exploring early experiences in teaching, this book helps primary teachers to understand their early professional development and learning and helps them to reflect on their own practice as well as that of others, offering a source of practical support throughout the important early years of their careers. Beginning Primary Teaching is essential reading for all new primary teachers, including those completing initial teacher training, newly qualified and early career teachers, as well as the growing number entering teaching through employment-based routes.",
      "thumbnail": "http://books.google.com/books/content?id=sjYcyLxsERYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=sjYcyLxsERYC&pg=PA71&dq=ebooks+insubject&hl=&cd=6&source=gbs_api"
    },
    {
      "id": "stpDBgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/stpDBgAAQBAJ",
      "title": "EBOOK: Whose Learning?",
      "author": "Kate Bullock",
      "category": "ebook",
      "description": "The traditional role of the form or class tutor has developed into that of an academic or personal tutor; that is, an adult who works with students to guide, support and help them manage their learning. Academic or personal tutoring as a practice of learning benefits many students in secondary schools and colleges. It is increasingly adopted and specifically customised by a range of institutions who believe it will establish good habits of learning now and in the future. Whose Learning? explores the concept of academic and personal tutoring and brings together established theoretical arguments; current activities in schools and classrooms; and observations gleaned from the authors’ own research. It recognises the important role of the personal tutor in working individually with his or her students, and illuminates the processes, educational relationships and learning interactions underpinning this role. The book addresses three fundamental strands of the learning process and their complex inter-relationships: Knowing what to learn Knowing how to learn Knowing yourself as a learner Offering examples of good practice in supporting student learning Whose Learning? is essential reading for student, beginning and more experienced teachers in schools and colleges who want to reflect on and improve their own practices.",
      "thumbnail": "http://books.google.com/books/content?id=stpDBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=stpDBgAAQBAJ&pg=PA8&dq=ebooks+insubject&hl=&cd=7&source=gbs_api"
    },
    {
      "id": "7mxsBAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/7mxsBAAAQBAJ",
      "title": "Colloquial Bulgarian (eBook And MP3 Pack)",
      "author": "Kjetil Ra Hauge",
      "category": "ebook",
      "description": "Colloquial Bulgarian provides a step-by-step course in Bulgarian as it is written and spoken today. Combining a user-friendly approach with a thorough treatment of the language, it equips learners with the essential skills needed to communicate confidently and effectively in Bulgarian in a broad range of situations. No prior knowledge of the language is required. Key features include: • progressive coverage of speaking, listening, reading and writing skills • structured, jargon-free explanations of grammar • an extensive range of focused and stimulating exercises • realistic and entertaining dialogues covering a broad variety of scenarios • useful vocabulary lists throughout the text • additional resources available at the back of the book, including a full answer key, a grammar summary and bilingual glossaries Balanced, comprehensive and rewarding, Colloquial Bulgarian will be an indispensable resource both for independent learners and students taking courses in Bulgarian. Course components: The complete course comprises the book and audio materials. These are available to purchase separately in paperback, ebook, CD and MP3 format. The paperback and CDs can also be purchased together in the great-value Colloquials pack. Paperback: 978-0-415-31625-5 (please note this does not include the audio) CDs : 978-0-415-31623-1eBook: 978-0-203-89078-3 (please note this does not include the audio, available from www.tandfebooks.com) MP3s: 978-0-415-47103-9 (available from www.tandfebooks.com) Pack : 978-0-415-44602-0 (paperback and CDs) For the eBook and MP3 pack, please find instructions on how to access the supplementary content for this title in the Prelims section.",
      "thumbnail": "http://books.google.com/books/content?id=7mxsBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=7mxsBAAAQBAJ&pg=PA211&dq=ebooks+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "XW1sBAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/XW1sBAAAQBAJ",
      "title": "Colloquial German (eBook And MP3 Pack)",
      "author": "Dietlinde Hatherall",
      "category": "ebook",
      "description": "‘If you want to get to grips with any of the [European] languages, Routledge’s Colloquial series is the best place you could start.’ – Rough Guide to Europe Specially written by experienced teachers for self-study or class use, the course offers you a step-by-step approach to written and spoken German. No prior knowledge of the language is required. What makes this new edition of Colloquial German your best choice in personal language learning? Interactive – lots of exercises for regular practice. Clear – concise grammar notes. Practical – useful vocabulary and pronunciation guide. Complete – including answer key and reference section. Recorded by native speakers, the audio files are an invaluable component of the course. While reinforcing material from the book, the CDs also contain a variety of additional exercises, including role-playing, and a useful guide to pronunciation. For the eBook and MP3 pack, please find instructions on how to access the supplementary content for this title in the Prelims section",
      "thumbnail": "http://books.google.com/books/content?id=XW1sBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=XW1sBAAAQBAJ&pg=PA3&dq=ebooks+insubject&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "4P-fCwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/4P-fCwAAQBAJ",
      "title": "University Libraries and Digital Learning Environments",
      "author": "Jill Beard",
      "category": "ebook",
      "description": "University libraries around the world have embraced the possibilities of the digital learning environment, facilitating its use and proactively seeking to develop the provision of electronic resources and services. The digital environment offers opportunities and challenges for librarians in all aspects of their work - in information literacy, virtual reference, institutional repositories, e-learning, managing digital resources and social media. The authors in this timely book are leading experts in the field of library and information management, and are at the forefront of change in their respective institutions. University Libraries and Digital Learning Environments will be invaluable for all those involved in managing libraries or learning services, whether acquiring electronic resources or developing and delivering services in digital environments.",
      "thumbnail": "http://books.google.com/books/content?id=4P-fCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=4P-fCwAAQBAJ&pg=PA221&dq=ebooks+insubject&hl=&cd=12&source=gbs_api"
    }
  ]
}