{
  "items": [
    {
      "id": "_CYZVa-Vld8C",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/_CYZVa-Vld8C",
      "title": "The Female Figure in Contemporary Historical Fiction",
      "author": "K. Cooper",
      "category": "fiction",
      "description": "From The Other Boleyn Girl to Fingersmith , this collection explores the popularity of female-centred historical novels in recent years. It asks how these representations are influenced by contemporary gender politics, and whether they can be seen as part of a wider feminist project to recover women's history.",
      "thumbnail": "http://books.google.com/books/content?id=_CYZVa-Vld8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=_CYZVa-Vld8C&pg=PT144&dq=fiction+insubject&hl=&cd=10&source=gbs_api"
    },
    {
      "id": "UA8fAgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/UA8fAgAAQBAJ",
      "title": "Greek Fiction",
      "author": "Richard Stoneman",
      "category": "fiction",
      "description": "First published in 1994. Routledge is an imprint of Taylor & Francis, an informa company.",
      "thumbnail": "http://books.google.com/books/content?id=UA8fAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=UA8fAgAAQBAJ&pg=PT160&dq=fiction+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "wcyq7mhbTxIC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/wcyq7mhbTxIC",
      "title": "Modernist Fiction",
      "author": "Randall Stevenson",
      "category": "fiction",
      "description": "To many writers of the early twentieth century, modernism meant not only the reshaping or abandonment of tradition but also an interest in psychology and in new concepts of space, time, art, and language. Randall Stevenson's important new analysis of the genre presents a lucid, comprehensive introduction to modernist fiction, covering a wide range of writers and works. Drawing on narrative theory and cultural history, Stevenson offers fresh insights into the work of such important modernists as Henry James, Joseph Conrad, Ford Madox Ford, D.H. Lawrence, Wyndham Lewis, Dorothy Richardson, May Sinclair, Virginia Woolf, and James Joyce. In addition he discusses the work of Marcel Proust, an important figure in the development of modernism in Europe. This illuminating book places the new imagination of the modernist age in its historical context and looks at how and why the pressures of early twentieth century life led to the development of this distinctive and influential literary form. This accessible account of modernism, modernity, and the novel will be welcomed by students, scholars, and general readers alike",
      "thumbnail": "http://books.google.com/books/content?id=wcyq7mhbTxIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=wcyq7mhbTxIC&pg=PA92&dq=fiction+insubject&hl=&cd=7&source=gbs_api"
    },
    {
      "id": "1CBjDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/1CBjDwAAQBAJ",
      "title": "2013 Novel & Short Story Writer's Market",
      "author": "Scott Francis",
      "category": "fiction",
      "description": "The Best Resource Available for Getting Your Fiction Published! The 2013 Novel & Short Story Writer's Market is the best resource available for fiction writers to get their short stories, novellas, and novels published. As with past editions, Novel & Short Story Writer's Market offers hundreds of listings for book publishers, literary agents, fiction publications, contests and more. Each listing includes contact information, submission guidelines, and other important tips. Fiction writers will also find and increased focus on editorial to help give context to the listing content. From amazing craft articles (crafting emotion in fiction) to helpful business advice (marketing a small press book), the 2013 Novel & Short Story Writer's Market offers everything a fiction writer looking to get published could want. PLEASE NOTE: Free subscriptions are NOT included with the e-book edition of this title.",
      "thumbnail": "http://books.google.com/books/content?id=1CBjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=1CBjDwAAQBAJ&pg=PT444&dq=fiction+insubject&hl=&cd=6&source=gbs_api"
    },
    {
      "id": "-7JbAgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/-7JbAgAAQBAJ",
      "title": "Encyclopedia of Fantasy and Horror Fiction",
      "author": "Don D'Ammassa",
      "category": "fiction",
      "description": "Presents articles on the horror and fantasy genres of fiction, including authors, themes, significant works, and awards.",
      "thumbnail": "http://books.google.com/books/content?id=-7JbAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=-7JbAgAAQBAJ&pg=RA1-PR62&dq=fiction+insubject&hl=&cd=4&source=gbs_api"
    },
    {
      "id": "9mOuBAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/9mOuBAAAQBAJ",
      "title": "The Longman Companion to Victorian Fiction",
      "author": "John Sutherland",
      "category": "fiction",
      "description": "With over 900 biographical entries, more than 600 novels synopsized, and a wealth of background material on the publishers, reviewers and readers of the age the Longman Companion to Victorian Fiction is the fullest account of the period's fiction ever published. Now in a second edition, the book has been revised and a generous selection of images have been chosen to illustrate various aspects of Victorian publishing, writing, and reading life. Organised alphabetically, the information provided will be a boon to students, researchers and all lovers of reading. The entries, though concise, meet the high standards demanded by modern scholarship. The writing - marked by Sutherland's characteristic combination of flair, clarity and erudition - is of such a high standard that the book is a joy to read, as well as a definitive work of reference.",
      "thumbnail": "http://books.google.com/books/content?id=9mOuBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=9mOuBAAAQBAJ&pg=PT209&dq=fiction+insubject&hl=&cd=3&source=gbs_api"
    },
    {
      "id": "mt4pEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/mt4pEAAAQBAJ",
      "title": "Writer's Market 100th Edition",
      "author": "Robert Lee Brewer",
      "category": "fiction",
      "description": "The most trusted guide to getting published, fully revised and updated Want to get published and paid for your writing? Let Writer's Market, 100th edition guide you through the process. It's the ultimate reference with thousands of publishing opportunities for writers, listings for book publishers, consumer and trade magazines, contests and awards, and literary agents—as well as new playwriting and screenwriting sections, along with contact and submission information. Beyond the listings, you'll find articles devoted to the business and promotion of writing. Discover 20 literary agents actively seeking writers and their writing, how to develop an author brand, and overlooked funds for writers. This 100th edition also includes the ever-popular pay-rate chart and book publisher subject index. You'll gain access to: • Thousands of updated listings for book publishers, magazines, contests, and literary agents • Articles devoted to the business and promotion of writing • A newly revised \"How Much Should I Charge?\" pay rate chart • Sample query letters for fiction and nonfiction • Lists of professional writing organizations",
      "thumbnail": "http://books.google.com/books/content?id=mt4pEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=mt4pEAAAQBAJ&pg=PA565&dq=fiction+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "c72vywEACAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/c72vywEACAAJ",
      "title": "Indigo",
      "author": "Padgett Powell",
      "category": "fiction",
      "description": "The first collection of nonfiction by \"one of the few truly important American writers of our time\" (Sam Lipsyte). Gathering pieces written during the past three decades, Indigo ranges widely in subject matter and tone, opening with “Cleve Dean,” which takes Padgett Powell to Sweden for the World Armwrestling Federation Championships, through to its closing title piece, which charts Powell’s lifelong fascination with the endangered indigo snake, “a thinking snake,” and his obsession with seeing one in the wild. “Some things in between” include an autobiographical piece about growing up in the segregated and newly integrated South and tributes to writers Powell has known, among them Donald Barthelme, who “changed the aesthetic of short fiction in America for the second half of the twentieth century,” and Peter Taylor, who briefly lived in Gainesville, Florida, where Powell taught for thirty-five years. There are also homages to other admired writers: Flannery O’Connor, “the goddesshead”; Denis Johnson, with his “hard honest comedy”; and William Trevor, whose Collected Stories provides “the most literary bang for the buck in the English world.” A throughline in many of the pieces is the American South—the college teacher who introduced Powell to Faulkner; the city of New Orleans, which “can render the improbable possible”; and the seductions of gumbo, sometimes cooked with squirrel meat. Also here is an elegy for Spode, Powell’s beloved pit bull: “I had a dog not afraid, it gave me great cheer and blustery vicarious happiness.” In addressing the craft of fiction, Powell ventures that “writing is controlled whimsy.” His idiosyncratic playfulness brings this collection to vivid life, while his boundless curiosity and respect for the truth keep it on course. As Pete Dexter writes in his foreword to Indigo, “He is still the best, even if not the best-known, writer of his generation.",
      "thumbnail": "http://books.google.com/books/content?id=c72vywEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=c72vywEACAAJ&dq=fiction+insubject&hl=&cd=10&source=gbs_api"
    },
    {
      "id": "5thAEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/5thAEAAAQBAJ",
      "title": "Persuasive Genres",
      "author": "Sujata S. Kathpalia",
      "category": "fiction",
      "description": "2021-09-30\",\n\"description\": \"This book provides an analysis of persuasive genres in the domain of media, ranging from traditional to new media genres on the internet. Kathpalia provides a layered analysis of a family of persuasive genres at the functional, semantic, and linguistic levels and a reconceptualization of genres as empowering rather than constraining, enabling rather than binding, and dynamic rather than static. The book leads readers to an understanding of genre that accounts for the way we interpret, respond to, and create genres in different settings whilst shedding light on how genres change and how they evolve into new and unique forms to meet the ever-changing needs of society. This book would be of interest to those studying or researching the topic of genres, and those interested in reconceptualizing the way in which we interpret and understand genres from linguistic and discourse perspectives.",
      "thumbnail": "http://books.google.com/books/content?id=5thAEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=5thAEAAAQBAJ&pg=PT82&dq=fiction+insubject&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "xc0WEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/xc0WEAAAQBAJ",
      "title": "City of Wonders",
      "author": "Eduardo Mendoza",
      "category": "fiction",
      "description": "Eduardo Mendoza's classic novel about the birth of Barcelona as a world city, embodied in the rise of the ambitious and unscrupulous Onofre Bouvila \"Though historical in subject matter, this story of Catalonian enterprise and Barcelonan ambition is thoroughly contemporary in spirit\" Jonathan Franzen Stung by the realisation that his father is a fraud and a failure, Onofre Bouvila leaves a life of rural poverty to seek his fortune in Barcelona. The year is 1888, and the Catalan capital is about to emerge from provincial obscurity to take its place amongst the great cities of the world, thanks to the upcoming Universal Exhibition. Thanks to a tip-off from his landlord's daughter, Onofre gets his big break distributing anarchist leaflets to workers preparing for the World Fair. From these humble beginnings, he branches out as a hair-tonic salesman, a burglar, a filmmaker, an arms smuggler and a political dealmaker, in a multifaceted career that brings him wealth and influence beyond his wildest dreams. But, just as Barcelona's rise makes it a haven for gangsters, crooks and spivs, vice begins to fester in Onofre's heart. And the climax to his remarkable story will come just as a second World Fair in 1929 marks the city's apotheosis. Translated from the Spanish by Nick Caistor",
      "thumbnail": "http://books.google.com/books/content?id=xc0WEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=xc0WEAAAQBAJ&pg=PP1&dq=fiction+insubject&hl=&cd=3&source=gbs_api"
    }
  ]
}