{
  "items": [
    {
      "id": "dzrIn8g0m44C",
      "selfLink": "Mary Shelley's Frankenstein",
      "title": "Mary Shelley's Frankenstein",
      "author": "Mary Wollstonecraft Shelle",
      "category": "Comics & Graphic Novels",
      "description": "In graphic novel format, tells Shelley's story of a scientist who creates life with unintended consequences.",
      "thumbnail": "http://books.google.com/books/content?id=dzrIn8g0m44C&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=dzrIn8g0m44C&dq=Mary+Wollstonecraft+inauthor&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "2uPi3hBgQAkC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/2uPi3hBgQAkC",
      "title": "Restaging the Sixties",
      "author": "James Martin Harding",
      "category": "Performing Arts",
      "description": "Examines the artistry, politics, and legacies of radical theater groups that came to prominence in the US during the period of the late sixties and early seventies. This book considers how radical theaters sought to redefine the relationship between theater and political activism, and how they challenged the foundations of theater itself.",
      "thumbnail": "http://books.google.com/books/content?id=2uPi3hBgQAkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=2uPi3hBgQAkC&pg=PA54&dq=Gertrude+Stein+inauthor&hl=&cd=2&source=gbs_api"
    },
    {
      "id": "qoTht-trmWQC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/qoTht-trmWQC",
      "title": "Modern Book Collecting",
      "author": "Robert Alfred Wilson",
      "category": "Reference",
      "description": "A new edition of the classic guide to book collecting includes a new section on Internet resources.",
      "thumbnail": "http://books.google.com/books/content?id=qoTht-trmWQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "previewLink": "http://books.google.com.eg/books?id=qoTht-trmWQC&pg=PT69&dq=Gertrude+Stein+inauthor&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "nsyqnGwA6cEC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/nsyqnGwA6cEC",
      "title": "The Black Lizard Big Book of Black Mask Stories",
      "author": "Otto Penzler",
      "category": "Fiction",
      "description": "An unstoppable anthology of crime stories culled from Black Mask magazine the legendary publication that turned a pulp phenomenon into literary mainstream. Black Mask was the apotheosis of noir. It was the magazine where the first hardboiled detective story, which was written by Carroll John Daly appeared. It was the slum in which such American literary titans like Dashiell Hammett and Raymond Chandler got their start, and it was the home of stories with titles like “Murder Is Bad Luck,” “Ten Carets of Lead,” and “Drop Dead Twice.” Collected here is best of the best, the hardest of the hardboiled, and the darkest of the dark of America’s finest crime fiction. This masterpiece collection represents a high watermark of America’s underbelly. Crime writing gets no better than this. Featuring • Deadly Diamonds • Dancing Rats • A Prize Fighter Fighting for His Life • A Parrot that Wouldn’t Talk Including • Dashiell Hammett’s The Maltese Falcon as it was originally published • Lester Dent's Luck in print for the first time",
      "thumbnail": "http://books.google.com/books/content?id=nsyqnGwA6cEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=nsyqnGwA6cEC&pg=PR13&dq=Gertrude+Stein+inauthor&hl=&cd=7&source=gbs_api"
    },
    {
      "id": "M6cwDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/M6cwDwAAQBAJ",
      "title": "Wide-Open Town",
      "author": "Nan Alamilla Boyd",
      "category": "History",
      "description": "A professor of womenÆs studies explores gay San Francisco in the 1960s, tracing the bar scene, gay activism, and official oppression carried out by the police and other government bodies. (Social Science)",
      "thumbnail": "http://books.google.com/books/content?id=M6cwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=M6cwDwAAQBAJ&pg=PA263&dq=Gertrude+Stein+inauthor&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "XSIKAQAAMAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/XSIKAQAAMAAJ",
      "title": "Program",
      "author": "Ann Arbor (Mich.) May Festival",
      "category": "Concert programs",
      "description": "",
      "thumbnail": "http://books.google.com/books/content?id=XSIKAQAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=XSIKAQAAMAAJ&pg=PA62&dq=Gertrude+Stein+inauthor&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "U39pAgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/U39pAgAAQBAJ",
      "title": "Forms of Engagement",
      "author": "Elizabeth Scott-Baumann",
      "category": "Literary Criticism",
      "description": "What does it mean for a woman to write an elegy, ode, epic, or blazon in the seventeenth century? How does their reading affect women's use of particular poetic forms and what can the physical appearance of a poem, in print and manuscript, reveal about how that poem in turn was read? Forms of Engagement shows how the aesthetic qualities of early modern women's poetry emerge from the culture in which they write. It reveals previously unrecognized patterns of influence between women poets Katherine Philips, Lucy Hutchinson, and Margaret Cavendish and their peers and predecessors: how Lucy Hutchinson responded to Ben Jonson and John Milton, how Margaret Cavendish responded to Thomas Hobbes and the scientists of the early Royal Society, and how Katherine Philips re-worked Donne's lyrics and may herself have influenced Abraham Cowley and Andrew Marvell. This book places analysis of form at the centre of an historical study of women writers, arguing that reading for form is reading for influence. Hutchinson, Philips, and Cavendish were immersed in mid-seventeenth century cultural developments, from the birth of experimental philosophy, to the local and state politics of civil war and the rapid expansion of women's print publication. For women poets, reworking poetic forms such as elegy, ode, epic, and couplet was a fundamental engagement with the culture in which they wrote. By focusing on these interactions, rather than statements of exclusion and rejection, a formalist reading of these women can actually provide a more nuanced historical view of their participation in literary culture.",
      "thumbnail": "http://books.google.com/books/content?id=U39pAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=U39pAgAAQBAJ&pg=PA77&dq=Margret+cavendish+inauthor&hl=&cd=3&source=gbs_api"
    },
    {
      "id": "z341EAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/z341EAAAQBAJ",
      "title": "العلوم في ثوانٍ للأطفال",
      "author": "جين بوتر",
      "category": "Literary Criticism",
      "description": "استمتِعْ بسحر العلوم مع هذه التجارب السريعة والسهلة التي تُقدِّمها جين بوتر. يمكنك إجراء كلَّ تجربةٍ منها في ١٠ دقائق — أو أقل — مليئة بالبهجة والمرح. تساعدك التعليماتُ المُقَدَّمة خطوةً بخطوة والرسومُ التوضيحية في تنفيذ التجارب على نحوٍ صحيح، وتساعدك التجاربُ ذاتها على معرفة معلوماتٍ عن كلِّ شيء؛ بدءًا من السبب في عدم كون البيض مستديرًا، حتى كيفية طفو وغوص الغواصات. معظم المواد والخامات المطلوبة لعمل التجارب ستجدها بالفعل في منزلك أو في الحي الذي تعيش فيه، كما يمكنك إجراء التجارب في أيِّ مكان. يحتوي الكتاب على ١٠٨ تجارب تغطِّي اثني عشر مجالًا مختلفًا؛ بما فيها الهواء والحيوانات والطاقة والجاذبية والمغناطيسية والضوء وجسم الإنسان، وغير ذلك. سوف تصنع قوسَ قُزَح على أرضية غرفتك، وتفجِّر بالونًا باستخدام عدسة مُكبِّرة، وستجعل علبةَ البن تعود لك بعد أن تدفعها بعيدًا عنك، وستجعل الماء ينحني بينما يتدفَّق من الصنبور؛ كلُّ ذلك بمساعدةٍ تقدِّمها لك مُعلِّمةٌ رائدةٌ.",
      "thumbnail": "http://books.google.com/books/content?id=z341EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=z341EAAAQBAJ&printsec=frontcover&dq=Margret+cavendish+inauthor&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "QockAAAAMAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/QockAAAAMAAJ",
      "title": "Shakespeare's Plays",
      "author": "William Shakespeare",
      "category": "literature",
      "description": "Wonderful Shakespeare's Plays",
      "thumbnail": "http://books.google.com/books/content?id=QockAAAAMAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": "http://books.google.com.eg/books/download/Shakespeare_s_Plays.pdf?id=QockAAAAMAAJ&hl=&output=pdf&sig=ACfU3U2waMT_uOI90_EF7J5JdEx_mW4-vw&source=gbs_api",
      "previewLink": "http://books.google.com.eg/books?id=QockAAAAMAAJ&pg=RA1-PA45&dq=william+shakespeare+inauthor&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "dfCXtW74mcEC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/dfCXtW74mcEC",
      "title": "A Traveler at Forty",
      "author": "Theodore Dreiser",
      "category": "Literary Criticism",
      "description": "After spending five months in Europe in 1911-1912, Dreiser wrote a detailed account of his travels that, despite his objections, was eviscerated to suit contemporary notions of taste and discretion. His editors insisted on drastic cuts, dropping over forty chapters and diluting many others. The truncated text was published in 1913. The excised portions consisted of autobiographical reminiscences, philosophical speculations, revealing portraits of prominent figures, accounts of Dreiser's relationships with women, and his careful observations of lower class urban life. Working with the unabridged text of a later typescript, the magazine articles based on this trip, and Dreiser's travel diary and correspondence, Renate von Bardeleben has been able to restore the book in full. The newly edited text is based on a typescript that Dreiser himself had prepared from his holograph to preserve it for future publication. This generously annotated edition reveals Dreiser's multiple motives in going to Europe : to cultivate his reputation in England, to search for authentic material for his Cowperwood trilogy, to educate himself in European art and history, to pursue his romantic interests, and to explore his ancestral roots in Germany. The 1913 text is about places; the fuller text is about Dreiser himself.",
      "thumbnail": "http://books.google.com/books/content?id=dfCXtW74mcEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=dfCXtW74mcEC&pg=RA3-PA815&dq=theodore+dreiser+inauthor&hl=&cd=1&source=gbs_api"
    }
  ]
}