{
  "items": [
    {
      "id": "lehLZV10XHQC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/lehLZV10XHQC",
      "title": "Philippians and Colossians",
      "author": "H. A. Ironside",
      "category": "mystery",
      "description": "This classic commentary series from one of the most creative and articulate expositors of the twentieth century is being reissued for a new generation.",
      "thumbnail": "http://books.google.com/books/content?id=lehLZV10XHQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=lehLZV10XHQC&pg=PT70&dq=mystery+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "qOKugwxPv_kC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/qOKugwxPv_kC",
      "title": "Mysterium and Mystery",
      "author": "William David Spencer",
      "category": "mystery",
      "description": "A reprint of the first book on the topic of the cleric as a crime-solver in fiction. Mysterium and Mystery by William David Spencer is a primary reference of meticulous scholarship for anyone interested in mystery literature.",
      "thumbnail": "http://books.google.com/books/content?id=qOKugwxPv_kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=qOKugwxPv_kC&pg=PA318&dq=mystery+insubject&hl=&cd=3&source=gbs_api"
    },
    {
      "id": "YMx64DyDMtsC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/YMx64DyDMtsC",
      "title": "10 Women of Mystery",
      "author": "Earl F. Bargainnier",
      "category": "mystery",
      "description": "This volume, which examines the special contributions of a number of women mystery writers, sheds light on this significant example of common interests in recreational reading among women and men and the reasons behind the early and continuing uncharacteristic near-equality of both sexes in this field of endeavor.",
      "thumbnail": "http://books.google.com/books/content?id=YMx64DyDMtsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=YMx64DyDMtsC&pg=PA191&dq=mystery+insubject&hl=&cd=4&source=gbs_api"
    },
    {
      "id": "TLWdNXcu76cC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/TLWdNXcu76cC",
      "title": "Mystery Movie Series of 1930s Hollywood",
      "author": "Ron Backer",
      "category": "mystery",
      "description": "This companion volume to Mystery Movie Series of 1940s Hollywood (McFarland, 2010) focuses on 22 series and 167 individual films, primarily released during the 1930s. It was a decade that featured some of the most famous cinema detectives of all time, among them Charlie Chan, Nick and Nora Charles, Philo Vance, Nancy Drew, and such lesser known but equally entertaining figures as Hildegarde Withers, Torchy Blane, Mr. Moto, Mr. Wong, and Brass Bancroft. Each mystery movie series is placed within its historical context, with emphasis on its source material and the changes or developments within the series over time. Also included are reviews of all the series’ films, analyzing the quality and cohesiveness of the mystery plotlines. For titles based on literary sources, a comparison between the film and the written work is provided.",
      "thumbnail": "http://books.google.com/books/content?id=TLWdNXcu76cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com/books/content?id=TLWdNXcu76cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    },
    {
      "id": "HeBYypkFaaoC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/HeBYypkFaaoC",
      "title": "The Mystery Fancier (Vol. 4 No. 4) July/August 1980",
      "author": "Guy M. Townsend",
      "category": "mystery",
      "description": "The Mystery Fancier, Volume 4 Number 4, July/August, 1980, contains: \"Little Old Men With Whom I'm Only Slightly Acquainted,\" by Ellen Nehr, \"The Dilemma of Datcher,\" by E. F. Bleiler, \"Spy Series Characters in Hardback, Part III,\" by Barry Van Tilburg, \"Leslie Charteris and the Saint: Five Decades of Partnership,\" by Jan Alexandersson and Iwan Hedman, and \"The Great Merlini,\" by Fred Dueren.",
      "thumbnail": "http://books.google.com/books/content?id=HeBYypkFaaoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=HeBYypkFaaoC&pg=PA7&dq=mystery+insubject&hl=&cd=7&source=gbs_api"
    },
    {
      "id": "aHJODwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/aHJODwAAQBAJ",
      "title": "British Mystery Classics - Arthur Morrison Edition (Illustrated)",
      "author": "Arthur Morrison",
      "category": "mystery",
      "description": "Martin Hewitt Investigator, The Red Triangle, The Case of Janissary, Old Cater's Money, The Green Diamond, Chronicles of Martin Hewitt, Adventures of Martin Hewitt, The First Magnum and many more",
      "thumbnail": "http://books.google.com/books/content?id=aHJODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=aHJODwAAQBAJ&pg=PT131&dq=mystery+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "ASvFAAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/ASvFAAAAQBAJ",
      "title": "Hollis Grant Mysteries 4-Book Bundle",
      "author": "Joan Boswell",
      "category": "mystery",
      "description": "This quadruple edition presents the entire Hollis Grant Mystery series. This digital bundle includes Cut off His Tale, Cut to the Quick, Cut to the Chase, and the fourth and final mystery, Cut to the Bone.",
      "thumbnail": "http://books.google.com/books/content?id=ASvFAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=ASvFAAAAQBAJ&pg=PT82&dq=mystery+insubject&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "ZHJODwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/ZHJODwAAQBAJ",
      "title": "MARTIN HEWITT Complete Series: 25 Mysteries in One Volume (Illustrated)",
      "author": "Arthur Morrison",
      "category": "mystery",
      "description": "Martin Hewitt is an ex lawyer's assistant who eventually found his inclination better suited to crime investigation. He is a low-key, realistic, lower class answer to Sherlock Holmes, though his cases are just as weird and mysterious as Holmes's. Martin Hewitt stories are similar in style to those of Arthur Conan Doyle, cleverly plotted and very amusing, while the character himself is a bit less arrogant and a bit more charming than Holmes. Table of Contents: Martin Hewitt, Investigator The Lenton Croft Robberies The Loss of Sammy Crockett The Case of Mr. Foggatt The Case of the Dixon Torpedo The Quinton Jewel Affair The Stanway Cameo Mystery The Affair of the Tortoise Chronicles of Martin Hewitt The Ivy Cottage Mystery The Nicobar Bullion Case The Holford Will Case The Case of the Missing Hand The Case of Laker, Absconded The Case of the Lost Foreigner Adventures of Martin Hewitt The Affair of Mrs. Seton's Child The Case of Mr. Geldard's Elopement The Case of the Dead Skipper The Case of the \"Flitterbat Lancers\" The Case of the Late Mr. Rewse The Case of the Ward Lane Tabernacle The Red Triangle The Affair of Samuel's Diamonds The Case of Mr. Jacob Mason The Case of the Lever Key The Case of the Burnt Barn The Case of the Admiralty Code The Adventure of Channel Marsh",
      "thumbnail": "http://books.google.com/books/content?id=ZHJODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=ZHJODwAAQBAJ&pg=PT130&dq=mystery+insubject&hl=&cd=11&source=gbs_api"
    },
    {
      "id": "fXlfSJozxF8C",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/fXlfSJozxF8C",
      "title": "Ghost Stories and Mysteries",
      "author": "J. S. LeFanu",
      "category": "mystery",
      "description": "Remaining supernatural fiction by writer many consider greatest ghost story writer of all time. Mystery stories are equally memorable.",
      "thumbnail": "http://books.google.com/books/content?id=fXlfSJozxF8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=fXlfSJozxF8C&pg=PR6&dq=mystery+insubject&hl=&cd=10&source=gbs_api"
    },
    {
      "id": "aFD9CAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/aFD9CAAAQBAJ",
      "title": "Maggy Thorsen Mysteries Box Set 1-3",
      "author": "Sandra Balzo",
      "category": "mystery",
      "description": "The first three titles in the Maggy Thorsen Coffeehouse Mystery Series UNCOMMON GROUNDS In her delightful debut, Balzo puts a 21st-century spin on the traditional cozy, replacing tea with coffee as the comfort beverage of choice. Maggy Thorsen, a divorcée whose husband left her for his 24-year-old dental hygienist, and two women friends are eager to open a coffee shop, Uncommon Grounds, in the small Wisconsin town of Brookhills, whose inhabitants include such recognizable types as the local gossip and tennis moms. The challenge becomes even greater when Maggy discovers the body of one of her partners, Patricia Harper, on the floor of their coffee shop. Determined to find out who killed Patricia and why, Maggy delves into the mystery with a sense of humor that would make Miss Marple smile. In her search for the truth, she works with, and sometimes against, the new and unpredictable county sheriff, Jake Pavlik—and uncovers at considerable personal risk the secrets of some of the town's most prominent citizens. GROUNDS FOR MURDER Exactly how hot is the competition at the annual coffee trade industry conference in Milwaukee? Scalding What's not hot? Finding Marvin LaRoche, owner of the HotWired coffeehouse chain store stone-cold dead under a banquet table in the middle of the convention. And everybody knows that Maggy was no great fan of Mr. LaRoche, nor of his overly competitive business practices - so it's up to Maggy's own amateur sleuthing skills to get herself out of the hotseat! BEAN THERE, DONE THAT Here's a tip: if your ex-husband's mistress-cum-missus asks for your help in proving that he cheated on her while he was married to you, just say no. And you most certainly should not invite this new missus, Mrs. Rachel Thorsen, in for a cup of coffee. But big-hearted Maggy can't seem to help her own hospitality. Unfortunately, most unfortunately, this mistress-cum-missus disappears shortly after her coffeehouse confab with Maggy and is later found murdered...making Maggy's ex, Ted, the chief suspect. Despite the tempting satisfaction of seeing her ex go down, Maggy knows Ted is innocent. Cheater? Yes. Murderer? Definitely not. So Maggy reluctantly agrees to help him. Now it's up to Maggy to discover the truth...even if it upsets her on-again, off-again relationship with the handsome Sheriff Jake Pavlik...",
      "thumbnail": "http://books.google.com/books/content?id=aFD9CAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=aFD9CAAAQBAJ&pg=PT176&dq=mystery+insubject&hl=&cd=12&source=gbs_api"
    }
  ]
}