{
  "items": [
    {
      "id": "rIK7AAAAIAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/rIK7AAAAIAAJ",
      "title": "The Philosophy of Popper",
      "author": "T. E. Burke",
      "category": "philosophy",
      "description": "Sir Karl Raimund Popper (28 July 1902 -17 September 1994) was an Austro-British philosopher and professor at the London School of Economics. He is generally regarded as one of the greatest philosophers of science of the 20th century. He also wrote extensively on social and political philosophy. [...] Popper is known for his attempt to repudiate the classical observationalist/Inductivist form of scientific method in favour of empirical falsification. He is also known for his opposition to the classical justificationist account of knowledge which he replaced with critical rationalism, \"the first non justificational philosophy of criticism in the history of philosophy\". In political discourse, he is known for his vigorous defence of liberal democracy and the principles of social criticism that he came to believe made a flourishing \"open society\" possible. -- From http://en.wikipedia.org (Sep. 7, 2012).",
      "thumbnail": "http://books.google.com/books/content?id=rIK7AAAAIAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=rIK7AAAAIAAJ&pg=PA4&dq=Philosophy+insubject&hl=&cd=2&source=gbs_api"
    },
    {
      "id": "NRdWDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/NRdWDwAAQBAJ",
      "title": "Philosophy",
      "author": "Michael Boylan",
      "category": "philosophy",
      "description": "Philosophy: An Innovative Introduction features a unique, engaging approach to introduce students to philosophy. It combines traditional readings and exercises with fictive narratives starring central figures in the history of the field from Plato to Martin Luther King, Jr. The book makes innovative use of compelling short stories from two writers who have prominently combined philosophy and fiction in their work. These narratives illuminate pivotal aspects of the carefully selected classic readings that follow. This gives students two ways to understand the philosophical positions: through indirect argument in fiction and through direct, deductive presentations. Study questions and writing exercises accompany each set of readings and help students grasp the material and create their own arguments.",
      "thumbnail": "http://books.google.com/books/content?id=NRdWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=NRdWDwAAQBAJ&pg=PT200&dq=Philosophy+insubject&hl=&cd=3&source=gbs_api"
    },
    {
      "id": "1ZfAAwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/1ZfAAwAAQBAJ",
      "title": "The Philosophy, Theory and Methods of J. L. Moreno",
      "author": "John Nolte",
      "category": "philosophy",
      "description": "J. L. Moreno, M.D., is recognized as the originator of sociometry and psychodrama, and was a prodigious creator of methods and theories of creativity, society, and human behavior. The methods and techniques he authored have been widely adopted; the theories and philosophy upon which the methods are founded have not, as they are frequently couched in language which is not easily understood. Moreno’s ideas about group psychotherapy have pretty well gotten lost, and what he considered his greatest contribution, sociometry, gets paid superficial attention by most psychodramatists . Group psychotherapy and psychodrama are both widely practiced but often based on non-Morenean theory, likely due to the inaccessibility of Moreno’s work. This book outlines Moreno’s early years (his religious phase), the philosophy on which the foundation of his methods are based, and a description of the three major methods Moreno originated: psychodrama, sociometry, and group psychotherapy. It provides a more systematic presentation of Moreno’s work and presents his philosophy and theory clearer, more understandable manner.",
      "thumbnail": "http://books.google.com/books/content?id=1ZfAAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=1ZfAAwAAQBAJ&pg=PT56&dq=Philosophy+insubject&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "UWSHDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/UWSHDwAAQBAJ",
      "title": "Omnidoxy",
      "author": "Cometan",
      "category": "philosophy",
      "description": "The Omnidoxy is the founding treatise of the Astronist religion and was solely authored by the philosopher and religious founder, Cometan. Partitioned into twelve disquisitions, each of which are further divided into hundreds of discourses, which are themselves titled by those which are known as rubrals, The Omnidoxy has been codified according to a unique writing structure known as insentence. The Omnidoxy not only forms the foundations of Astronism, but it remains the primary modern contributor and the book that ignited the establishment of the Astronic tradition of religion which encompasses the philosophy of Astronism. Introducing brand new philosophical concepts such as cosmocentricity, reascensionism, transcensionism, and sentientism amongst many others, The Omnidoxy remains the principal signifier of a new era in philosophy. The Omnidoxy births hundreds of new belief orientations, schools of thought, neologisms, disciplines of study, theories, and concepts which, when combined and considered collectively, have formed the basis of Astronism. The authorship of The Omnidoxy rests with the single individual philosopher, Cometan who began writing The Omnidoxy at the age of seventeen driven by what he terms as personal inspiration. The historical origination of The Omnidoxy rests in its authorship by Brandon Taylorian during early 21st century England, specifically in the northern county of Lancashire. Like in all textual criticism, the timing and location of the codification of The Omnidoxy is integral to understanding why and how it was written, especially by considering the influential factors impacting Taylorian during his construction of the text, particularly the cultural, political, religious, and social contexts of Taylorian's personal life and of wider society at the time. This forms an important branch of study within omnidoxicology known as omnidoxical criticism, or omnidoxical exegesis in which scholars study and investigate The Omnidoxy in order to discern conclusive judgements inspired by how, where, why, by whom, for whom, and in what circumstances The Omnidoxy was written.",
      "thumbnail": "http://books.google.com/books/content?id=UWSHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=UWSHDwAAQBAJ&pg=PA1204&dq=Philosophy+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "l5ah9ZyrgJ4C",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/l5ah9ZyrgJ4C",
      "title": "History of Philosophy",
      "author": "Frederick Charles Copleston",
      "category": "philosophy",
      "description": "A detailed study, designed for use in Catholic seminaries, of classical philosophy, stressing the theories of Socrates, Plato, Aristotle, and their followers",
      "thumbnail": "http://books.google.com/books/content?id=l5ah9ZyrgJ4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=l5ah9ZyrgJ4C&pg=PA596&dq=Philosophy+insubject&hl=&cd=10&source=gbs_api"
    },
    {
      "id": "wWsAo4HtqeQC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/wWsAo4HtqeQC",
      "title": "Philosophy and Psychoanalysis",
      "author": "Jon Mills",
      "category": "philosophy",
      "description": "Philosophy and Psychoanalysis",
      "thumbnail": "http://books.google.com/books/content?id=wWsAo4HtqeQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=wWsAo4HtqeQC&pg=PA62&dq=Philosophy+insubject&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "G8PpCQAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/G8PpCQAAQBAJ",
      "title": "Unifying the Philosophy of Truth",
      "author": "Theodora Achourioti",
      "category": "philosophy",
      "description": "This anthology of the very latest research on truth features the work of recognized luminaries in the field, put together following a rigorous refereeing process. Along with an introduction outlining the central issues in the field, it provides a unique and unrivaled view of contemporary work on the nature of truth, with papers selected from key conferences in 2011 such as Truth Be Told (Amsterdam), Truth at Work (Paris), Paradoxes of Truth and Denotation (Barcelona) and Axiomatic Theories of Truth (Oxford). Studying the nature of the concept of ‘truth’ has always been a core role of philosophy, but recent years have been a boom time in the topic. With a wealth of recent conferences examining the subject from various angles, this collection of essays recognizes the pressing need for a volume that brings scholars up to date on the arguments. Offering academics and graduate students alike a much-needed repository of today’s cutting-edge work in this vital topic of philosophy, the volume is required reading for anyone needing to keep abreast of developments, and is certain to act as a catalyst for further innovation and research.",
      "thumbnail": "http://books.google.com/books/content?id=G8PpCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=G8PpCQAAQBAJ&pg=PA59&dq=Philosophy+insubject&hl=&cd=12&source=gbs_api"
    },
    {
      "id": "5_ZMONP_uH8C",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/5_ZMONP_uH8C",
      "title": "A History of Philosophy",
      "author": "Frederick Copleston",
      "category": "philosophy",
      "description": "Copleston, an Oxford Jesuit and specialist in the history of philosophy, first created his history as an introduction for Catholic ecclesiastical seminaries. However, since its first publication (the last volume appearing in the mid-1970s) the series has become the classic account for all philosophy scholars and students. The 11-volume series gives an accessible account of each philosopher's work, but also explains their relationship to the work of other philosophers.",
      "thumbnail": "http://books.google.com/books/content?id=5_ZMONP_uH8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=5_ZMONP_uH8C&pg=PA596&dq=Philosophy+insubject&hl=&cd=13&source=gbs_api"
    },
    {
      "id": "RN8kDQAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/RN8kDQAAQBAJ",
      "title": "John Protevi",
      "author": "John Protevi",
      "category": "philosophy",
      "description": "The first ever dictionary of continental philosophy to be published.With over 450 clearly written definitions and articles by an international team of specialists, this authoritative dictionary covers the thinkers, topics and technical terms associated with the many fields known as 'continental' philosophy'. Special care has been taken to explain the complex terminology of many continental thinkers. Researchers, students and professional philosophers alike will find the dictionary an invaluable reference tool.Key features include:*in-depth entries on major figures and topics*over 190 shorter articles on other figures and topics*over 250 items on technical terms used by continental thinkers, from abjection [Kristeva] to worldhood [Heidegger]*coverage of related subjects that use continental terms and methods*extensive cross-referencing, allowing readers to relate and pursue ideas in depth.Entries include: Major Figures and Topics: Deleuze, Derrida, Foucault, Hegel, Heidegger, Husserl, Irigaray, Kant, NietzscheEpistemology, Feminism, German Idealism, Marxism, Phenomenology, Poststructuralism, Time, etc.Other figures and topics covered include: Adorno, Althusser, Arendt, Badiou, Barthes, Bergson, Butler, Haraway, Habermas, Kristeva, Merleau-Ponty, Sartre, Schelling, Schiller, Weber, Weil, Wittgenstein, Zizek, etc;African Philosophy, Cognitive Science, Death, Ecocriticism, Embodiment, Environmental Philosophy, Modernity, Philosophy of Nature, NeoThomism, Postcolonial Theory, Psychology, Race Theory, Sex / sexuality, Space, Speech Act Theory, Structuralism, Subject, 'Young Hegelians', etc.",
      "thumbnail": "http://books.google.com/books/content?id=RN8kDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=RN8kDQAAQBAJ&pg=PA320&dq=Philosophy+insubject&hl=&cd=14&source=gbs_api"
    },
    {
      "id": "jq6tDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/jq6tDwAAQBAJ",
      "title": "Moral Foundations of Philosophy of Mind",
      "author": "Joel Backström",
      "category": "philosophy",
      "description": "This volume brings together a collection of essays that explore in a new way how unacknowledged moral concerns are integral to debates in the philosophy of mind.The radical suggestion of the book is that we can make sense of the internal dynamics and cultural significance of these debates only when we understand the moral forces that shape them. Drawing inspiration from a variety of traditions including Wittgenstein, Lacan, phenomenology and analytic philosophy, the authors address a wide range of topics including the mind/body-problem, the problem of other minds, subjectivity and objectivity, the debates on mindreading, naturalism, reductive physicalism, representationalism and the ‘E-turn’; Dennett’s heterophenomenology, McDowell’s neo-Kantianism, Wittgenstein’s ‘private language’ considerations and his notion of an ‘attitude towards a soul’; repression, love, conscience, the difficulties of self-understanding, and the methods and aims of philosophy. Through a combination of detailed, immanent criticism and bold constructive work, the authors move the discussion to a new level, beyond humanistic or conservative critiques of naturalism and scientism.",
      "thumbnail": "http://books.google.com/books/content?id=jq6tDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=jq6tDwAAQBAJ&pg=PA232&dq=Philosophy+insubject&hl=&cd=16&source=gbs_api"
    }
  ]
}