{
  "items": [
    {
      "id": "VYkhAwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/VYkhAwAAQBAJ",
      "title": "The Psychology of Personhood",
      "author": "Jack Martin",
      "category": "psychology",
      "description": "What is a person? Surprisingly little attention is given to this question in psychology. For much of the past century, psychology has tended to focus on the systematic study of processes rather than on the persons who enact and embody them. In contrast to the reductionist picture of much mainstream theorising, which construes persons as their mental lives, behaviours or neurophysiological particulars, The Psychology of Personhood presents persons as irreducibly embodied and socially situated beings. Placing the study of persons at the centre of psychology, this book presents novel insights on the typical, everyday actions and experiences of persons in relation to each other and to the broader society and culture. Leading scholars from diverse academic disciplines paint an integrative portrait of the psychological person within evolutionary, historical, cultural, developmental and everyday contexts.",
      "thumbnail": "http://books.google.com/books/content?id=VYkhAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=VYkhAwAAQBAJ&pg=PA5&dq=Psychology+insubject&hl=&cd=3&source=gbs_api"
    },
    {
      "id": "9lkiazIPqI0C",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/9lkiazIPqI0C",
      "title": "Trends in Experimental Psychology Research",
      "author": "Diane T. Rosen",
      "category": "psychology",
      "description": "This new book includes within its scope original research on basic processes of cognition, learning, memory, imagery, concept formation, problem-solving, decision-making, thinking, reading, and language processing.",
      "thumbnail": "http://books.google.com/books/content?id=9lkiazIPqI0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=9lkiazIPqI0C&pg=PA231&dq=Psychology+insubject&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "nc6l9BpNg0EC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/nc6l9BpNg0EC",
      "title": "The Psychology of Learning and Motivation",
      "author": "Brian H. Ross",
      "category": "psychology",
      "description": "The Psychology of Learning and Motivation publishes empirical and theoretical contributions in cognitive and experimental psychology, ranging from classical and instrumental conditioning to complex learning and problem solving. Each chapter provides a thoughtful integration of a body of work.",
      "thumbnail": "http://books.google.com/books/content?id=nc6l9BpNg0EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=nc6l9BpNg0EC&pg=PA142&dq=Psychology+insubject&hl=&cd=6&source=gbs_api"
    },
    {
      "id": "rCB5AgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/rCB5AgAAQBAJ",
      "title": "Psychology at the Turn of the Millennium, Volume 2",
      "author": "Lars Backman",
      "category": "psychology",
      "description": "These two volumes represent the cutting edge of contemporary theory and research in psychological science. Based on the keynote and state-of-the-art lectures from the 27th International Congress of Psychology, the volumes feature a collection of chapters written by international leaders in psychological scholarship. The chapters reflect the diversity of current research topics in psychology, where old boundaries have become obsolete and subdivisions from the past merge to form new objects of study. Volume 1 addresses cognitive, biological, and health perspectives. It includes sections on the neural mechanisms underlying psychological processes; the core areas in experimental psychology, perception, attention, learning, and memory; the multiple aspects of psychological health; the interaction between cognitive and emotional processes; and higher cognitive processes with special focus on decision-making and language. Volume 2 deals with social, developmental, and clinical perspectives. The sections highlight human development across the life span; basic and applied issues in personality, emotion, and clinical psychology; social psychology, ranging from experimental work through social constructivism; and gender.",
      "thumbnail": "http://books.google.com/books/content?id=rCB5AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=rCB5AgAAQBAJ&pg=PA338&dq=Psychology+insubject&hl=&cd=7&source=gbs_api"
    },
    {
      "id": "LpbHDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/LpbHDwAAQBAJ",
      "title": "Principles of Psychology",
      "author": "Matt Jarvis",
      "category": "psychology",
      "description": "Principles of Psychology offers students a complete introduction to psychology. It balances contemporary approaches with classic perspectives, weaves stimulating conceptual issues throughout the text, and encourages students to think critically, creatively, and practically about the subject and how it applies to the real-world.",
      "thumbnail": "http://books.google.com/books/content?id=LpbHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=LpbHDwAAQBAJ&pg=PA25&dq=Psychology+insubject&hl=&cd=10&source=gbs_api"
    },
    {
      "id": "HEcwBQAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/HEcwBQAAQBAJ",
      "title": "A History of Modern Psychology",
      "author": "Duane P. Schultz",
      "category": "psychology",
      "description": "A market leader for over 30 years, A HISTORY OF MODERN PSYCHOLOGY has been praised for its comprehensive coverage and biographical approach. Focusing on modern psychology, the text's coverage begins with the late 19th century. The authors personalize the history of psychology not only by using biographical information on influential theorists, but also by showing how the major events in the theorists' lives affected their ideas, approaches, and methods. Substantial updates in the eleventh edition include discussions of the latest developments in positive psychology; the increasing role of brain science in psychology; the return of Freud's anal personality; Ada Lovelace, the virgin Bride of Science; the interpretation of dreams by computers; the use of Coca Cola as a nerve tonic, and many other topics. The result is a text that is as timely and relevant today as it was when it was first introduced. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.",
      "thumbnail": "http://books.google.com/books/content?id=HEcwBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=HEcwBQAAQBAJ&pg=PA2&dq=Psychology+insubject&hl=&cd=11&source=gbs_api"
    },
    {
      "id": "sw4NHyThFFkC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/sw4NHyThFFkC",
      "title": "Psychological Experiments on the Internet",
      "author": "Michael H. Birnbaum",
      "category": "psychology",
      "description": "Until recently, most psychological research was conducted using subject samples in close proximity to the investigators--namely university undergraduates. In recent years, however, it has become possible to test people from all over the world by placing experiments on the internet. The number of people using the internet for this purpose is likely to become the main venue for subject pools in coming years. As such, learning about experiments on the internet will be of vital interest to all research psychologists. Psychological Experiments on the Internet is divided into three sections. Section I discusses the history of web experimentation, as well as the advantages, disadvantages, and validity of web-based psychological research. Section II discusses examples of web-based experiments on individual differences and cross-cultural studies. Section III provides readers with the necessary information and techniques for utilizing the internet in their own research designs. * Innovative topic that will capture the imagination of many readers * Includes examples of actual web based experiments",
      "thumbnail": "http://books.google.com/books/content?id=sw4NHyThFFkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=sw4NHyThFFkC&pg=PA48&dq=Psychology+insubject&hl=&cd=14&source=gbs_api"
    },
    {
      "id": "QBCIDQAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/QBCIDQAAQBAJ",
      "title": "Research In Psychology Methods and Design",
      "author": "C. James Goodwin",
      "category": "psychology",
      "description": "TRY (FREE for 14 days), OR RENT this title: www.wileystudentchoice.com An approachable, coherent, and important text, Research in Psychology: Methods and Design, 8th Edition continues to provide its readers with a clear, concise look at psychological science, experimental methods, and correlational research in this newly updated version. Rounded out with helpful learning aids, step-by-step instructions, and detailed examples of real research studies makes the material easy to read and student-friendly.",
      "thumbnail": "http://books.google.com/books/content?id=QBCIDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=QBCIDQAAQBAJ&pg=PA3&dq=Psychology+insubject&hl=&cd=15&source=gbs_api"
    },
    {
      "id": "PLlRCgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/PLlRCgAAQBAJ",
      "title": "The Oxford Handbook of Undergraduate Psychology Education",
      "author": "Dana S. Dunn",
      "category": "psychology",
      "description": "The Oxford Handbook of Undergraduate Psychology Education is dedicated to providing comprehensive coverage of teaching, pedagogy, and professional issues in psychology. The Handbook is designed to help psychology educators at each stage of their careers, from teaching their first courses and developing their careers to serving as department or program administrators. The goal of the Handbook is to provide teachers, educators, researchers, scholars, and administrators in psychology with current, practical advice on course creation, best practices in psychology pedagogy, course content recommendations, teaching methods and classroom management strategies, advice on student advising, and administrative and professional issues, such as managing one's career, chairing the department, organizing the curriculum, and conducting assessment, among other topics. The primary audience for this Handbook is college and university-level psychology teachers (at both two and four-year institutions) at the assistant, associate, and full professor levels, as well as department chairs and other psychology program administrators, who want to improve teaching and learning within their departments. Faculty members in other social science disciplines (e.g., sociology, education, political science) will find material in the Handbook to be applicable or adaptable to their own programs and courses.",
      "thumbnail": "http://books.google.com/books/content?id=PLlRCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=PLlRCgAAQBAJ&pg=PA289&dq=Psychology+insubject&hl=&cd=16&source=gbs_api"
    },
    {
      "id": "EwdpAgAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/EwdpAgAAQBAJ",
      "title": "The Oxford Handbook of Rehabilitation Psychology",
      "author": "Paul Kennedy",
      "category": "psychology",
      "description": "Rehabilitation psychology is one of the fastest growing fields in applied psychology and involves the application of psychological knowledge and skills to the understanding and treatment of individuals with physical disabilities. Rehabilitation psychologists aim to optimize outcomes in terms of health, independence, and daily functioning while also minimizing secondary health problems. The Oxford Handbook of Rehabilitation Psychology provides background and overview of the associated psychological processes and types of interventions that are critical in managing the consequences of disability and chronic disease. Psychological models and research have much to contribute to those working with the physical disabilities; this volume has a broad cognitive behavioral focus within the general banner of the biopsychosocial framework. The editor has successfully brought together contributions from a range of well-established and experienced researchers and practitioners from a wide variety of clinical and academic contexts. They highlight the critical psychological aspects, review applied interventions, and consider the wider conceptual, clinical and professional themes associated with disability and society.",
      "thumbnail": "http://books.google.com/books/content?id=EwdpAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=EwdpAgAAQBAJ&pg=PA184&dq=Psychology+insubject&hl=&cd=17&source=gbs_api"
    }
  ]
}