{
  "items": [
    {
      "id": "Ka-5zgEACAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/Ka-5zgEACAAJ",
      "title": "Shelter Under the Sun",
      "author": "Krisztina Rita Molnar",
      "category": "horror",
      "description": "New poetry from three prominent Hungarian women, translated from Hungarian into English. Their voices contribute to the poetic heritage of a poetry-loving people.",
      "thumbnail": "http://books.google.com/books/content?id=Ka-5zgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=Ka-5zgEACAAJ&dq=horror+insubject&hl=&cd=4&source=gbs_api"
    },
    {
      "id": "_H1JEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/_H1JEAAAQBAJ",
      "title": "Daily Fresh",
      "author": "Jory Post",
      "category": "Literary Collections",
      "description": "In the summer of 2020, the final summer of his life, Jory Post gave himself an assignment: He would write one essay a day, inspired by whatever caught his eye and imagination. The seventy essays that emerged — personal and idiosyncratic, contemplative and fierce — range in subject from the writing life, extinct birds, and the origins of words to the \"three ‘C’s\" (cancer, chemo, and Covid) and his love for his wife and friends. As he faced his last days, Jory Post measured the world around him and threw the full reach of his emotions and literary skills into these pages.",
      "thumbnail": "http://books.google.com/books/content?id=_H1JEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=_H1JEAAAQBAJ&pg=PP1&dq=drama+insubject&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "opBfEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/opBfEAAAQBAJ",
      "title": "Points of Convergence in Romance Linguistics",
      "author": "Gabriela Alboiu",
      "category": "Language Arts & Disciplines",
      "description": "This volume brings together selected papers from the 48th annual Linguistics Symposium on Romance Languages, held at York University in Toronto, Canada, in April 2018. It presents original research on a wide variety of Romance languages both past (Latin, Old Catalan, Old Iberian Romance, Old Spanish, Old Portuguese, and West-Iberian Medieval Latin) and present (Brazilian Portuguese, Catalan, French, Picard, Portuguese, Romanian, and Spanish) along with a number of contemporary dialects, including Basque Country Spanish, Dominican Spanish, Maine French, Neapolitan, and Picardie French. Divided into four sections — Interfaces, Bridging issues at the CP-TP-vP levels, Bridging issues at the PP-DP levels, and Bridging issues in linguistics — the volume gives researchers and advanced students access to contemporary issues and novel ideas bridging across various areas of Romance linguistics (e.g., morphology, syntax, semantics, phonology, sociolinguistics, first and second language acquisition)",
      "thumbnail": "http://books.google.com/books/content?id=opBfEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=opBfEAAAQBAJ&pg=PA16&dq=romance+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "8XpYEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/8XpYEAAAQBAJ",
      "title": "The Doomsday Medallion",
      "author": "Avanti Centrae",
      "category": "Fiction",
      "description": "The next standalone installment of the #1 international bestselling \"Da Vinci Code meets Tomb Raider\" VanOps thriller series is a heart-stopping story of spies, lies, and family ties",
      "thumbnail": "http://books.google.com/books/content?id=8XpYEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=8XpYEAAAQBAJ&pg=PT59&dq=thriller+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "4P8GEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/4P8GEAAAQBAJ",
      "title": "A Dead-End Job",
      "author": "Justin Alcala",
      "category": "Fiction",
      "description": "Fans of Terry Pratchett and Shane Kuhn’s THE INTERN’S HANDBOOK will love this noir supernatural thriller",
      "thumbnail": "http://books.google.com/books/content?id=4P8GEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=4P8GEAAAQBAJ&dq=thriller+insubject&hl=&cd=7&source=gbs_api"
    },
    {
      "id": "tkyEzgEACAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/tkyEzgEACAAJ",
      "title": "The Quiet Haven",
      "author": "Ian Bradley",
      "category": "Death",
      "description": "This unique anthology of biblical and other sacred religious texts, sermons, essays, poems, and hymns offers a rich collection of perspectives and beliefs on what lies beyond death, and is designed to bring encouragement, comfort, and reassurance as well as prompting spiritual reflection and intellectual curiosity. Ian Bradley is a much-respected writer, broadcaster, and academic, and a former Church of Scotland minister, and offers a short commentary on the facing page of each reading, providing context and helpful information and observations. This book will be a valuable resource for all who seek to understand death personally or professionally.",
      "thumbnail": "http://books.google.com/books/content?id=tkyEzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=tkyEzgEACAAJ&dq=poetry+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "-SJCEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/-SJCEAAAQBAJ",
      "title": "The Notes",
      "author": "Ludwig Hohl",
      "category": "Philosophy",
      "description": "A collection of illuminating observations on life and art, from an acclaimed Swiss modernist Revered by Bertolt Brecht and Max Frisch as one of Switzerland’s most commanding writers, Ludwig Hohl spent most of his waking hours with a pen in hand, collecting quotes from others and recording ruminations of his own. Composed between 1934 and 1936 during his residence in the Netherlands in a state of “extreme spiritual desolation,” The Notes is Hohl’s magnum opus: an assemblage of his epiphany-like observations, disparate in subject yet threaded together by a relentless exploration of the nature and origins of creativity. Inspired by Spinoza, Goethe, and many others, The Notes contends with the purpose of work, the vitality of art, and the inevitability of death—a valiant, uncompromising exercise in hope against the devastating backdrop of twentieth-century Europe. This abridged edition, expertly translated by Tess Lewis and with an illuminating foreword by Joshua Cohen, introduces the reader to this remarkable work and its writer.",
      "thumbnail": "http://books.google.com/books/content?id=-SJCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=-SJCEAAAQBAJ&pg=PP1&dq=poetry+insubject&hl=&cd=7&source=gbs_api"
    },
    {
      "id": "9h0xEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/9h0xEAAAQBAJ",
      "title": "We Travelled",
      "author": "David Hare",
      "category": "Social Science",
      "description": "David Hare's great quality has always been his refusal to accept the division between fact and imagination. His creative invention is fired by public realities and in turn he makes those realities feel deeply personal. That same quality is wonderfully at work in his essays and poems. Whether he is writing about Tony Blair or Joan Didion, whether he is writing out of love or rage, evoking the intimate moments of his own life or the great moral questions of our times, he brings his subjects to life with an irresistible immediacy. All the wit, combativeness, energy and edge he has brought to the stage are present here on the page.' Fintan O'Toole I can't remember if I had any plans for the twenty-first century. I was already 52 when it arrived. But events raced off in such unexpected directions that any possible ideas must have gone out the window. Many of us shared the sensation that history was speeding up. Recording dizzying changes in culture and politics, these elegant essays range in subject from the photographer Lee Miller to the Archbishop of Canterbury, from the actress Sarah Bernhardt to the rapist Jimmy Saville, from a celebration of Mad Men to a diagnosis of the incoherence of Conservatism in the new century. The poems, in contrast, are private: tender meditations, filled with love, memory, vulnerability and the melancholy of ageing. This is a powerful compilation of prose and poetry by one of the distinctive thinkers of our time.",
      "thumbnail": "http://books.google.com/books/content?id=9h0xEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=9h0xEAAAQBAJ&printsec=frontcover&dq=poetry+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "D31QEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/D31QEAAAQBAJ",
      "title": "International Perspectives on Knowledge and Curriculum",
      "author": "Brian Hudson",
      "category": "Education",
      "description": "Drawing on the idea of powerful knowledge, this book interrogates the epistemic quality of education in schools, in terms of what students are expected to know, make sense of and be able to do through the curriculum.",
      "thumbnail": "http://books.google.com/books/content?id=D31QEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=D31QEAAAQBAJ&printsec=frontcover&dq=science+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "D0GZzgEACAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/D0GZzgEACAAJ",
      "title": "Food Industry 4.0",
      "author": "Wayne Martindale",
      "category": "science",
      "description": "Unlocking Advancement Opportunities in the Food Manufacturing Sector",
      "thumbnail": "http://books.google.com/books/content?id=D0GZzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=D0GZzgEACAAJ&dq=science+insubject&hl=&cd=2&source=gbs_api"
    }

  ]
}