{
  "items": [
    {
      "id": "1-5DONneQowC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/1-5DONneQowC",
      "title": "Learning to Teach RE in the Secondary School",
      "author": "Andrew Wright",
      "category": "technoology",
      "description": "Learning to Teach Religious Education in the Secondary School draws together insights from current educational theory and the best contemporary classroom teaching and learning, and suggests tasks, activities, and further reading designed to enhance the quality of initial school experience for the student teacher. It aims to support teachers in developing levels of religious and theological literacy, both of individual pupils and the society as a whole. Practising teachers and students will appreciate this comprehensive and accessible introduction to the craft of teaching Religious Education in the secondary school.",
      "thumbnail": "http://books.google.com/books/content?id=1-5DONneQowC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=1-5DONneQowC&pg=PT285&dq=technology+insubject&hl=&cd=1&source=gbs_api"
    },
    {
      "id": "UPTjGFA5NugC",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/UPTjGFA5NugC",
      "title": "Practical Ajax Projects with Java Technology",
      "author": "Frank Zammetti",
      "category": "technology",
      "description": "This book will save Java developers countless hours of development time by providing seven complete Ajax applications to learn from and adapt for use in their own projects. The applicaions include an online calendaring/scheduling system, a FlickrTM-style photo gallery application, and an Ajax role-playing game. The book also details the set-up of a perfect Java/Ajax development environment in which to construct the applications; Java technologies covered include Apache, Ant, Ajax Tags, Struts, Prototype, DWR, Dojo, and more. This is the first book of its kind, aimed at Java/Ajax developers.",
      "thumbnail": "http://books.google.com/books/content?id=UPTjGFA5NugC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=UPTjGFA5NugC&pg=PA189&dq=technology+insubject&hl=&cd=2&source=gbs_api"
    },
    {
      "id": "laqeBQAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/laqeBQAAQBAJ",
      "title": "Cases on Technologies for Educational Leadership and Administration in Higher Education",
      "author": "Luppicini, Rocci",
      "category": "technology",
      "description": "Institutions of higher learning rely heavily on technological innovation to effectively deliver educational services and provide students with a quality experience. Thus, the ability of leaders and administrators at these institutions to produce effective policy and to innovate in an evolving world hinges on successfully applying technological solutions to everyday challenges facing their college or university. Cases on Technologies for Educational Leadership and Administration in Higher Education brings together a collection of practical case studies exploring the application of new technologies, such as student management systems and enterprise resource planning, along with strategies that educational leaders can use to foster organizational change. Targeted toward college and university administrators and leaders, this book discusses successful strategies for managing universities in the tech-savvy 21st century.",
      "thumbnail": "http://books.google.com/books/content?id=laqeBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=laqeBQAAQBAJ&pg=PA231&dq=technology+insubject&hl=&cd=6&source=gbs_api"
    },
    {
      "id": "EauAAAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/EauAAAAAQBAJ",
      "title": "Debates in Design and Technology Education",
      "author": "Gwyneth Owen-Jackson",
      "category": "technology",
      "description": "Design and Technology has long held a controversial place on the school curriculum, with some arguing that it shouldn’t be there at all. This book presents and questions considered arguments and judgements, and explores the major issues that all D&T teachers encounter in their daily professional lives. In exploring some of the key debates, it encourages critical reflection and aims to stimulate both novice and experienced teachers to think more deeply about their practice, and link research and evidence to what they have observed in schools. Written by expert design and technology education professionals, chapters tackle established and contemporary issues, enabling you to reach informed judgements and argue your point of view with deeper theoretical knowledge and understanding. Debates covered include: What is the purpose of design and technology? Is it a vocational or academic subject? What is the place of design and technology within the STEM agenda? What knowledge and skills do teachers really need? What does the design and technology gender divide mean for schools and pupils? Is it a ‘creative’ subject? What is the future for design and technology? With its combination of expert opinion and fresh insight, Debates in Design and Technology Education is the ideal companion for any student or practising teacher engaged in initial training, continuing professional development or Masters level study.",
      "thumbnail": "http://books.google.com/books/content?id=EauAAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=EauAAAAAQBAJ&printsec=frontcover&dq=technology+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "tgjLXo5xj_4C",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/tgjLXo5xj_4C",
      "title": "Subject Teaching and Teacher Education in the New Century",
      "author": "Yin Cheong Cheng",
      "category": "technology",
      "description": "This 544-page book has 22 chapters prepared by experienced and renowned scholars and researchers from different parts of the world. Grouped into three sections- \"Information Technology, Science and Mathematics\", \"Social Sciences and General Studies\", and \"Languages\" - the chapters represent an important collection of international endeavours committed to facilitate the much needed paradigm shift in subject curriculum and pedagogy and reinforce the quest for a new knowledge base that can support the search for new conceptions, models, perspectives, innovations, and practices for teaching effectiveness and teacher development in different parts of the world. The target audiences are teacher educators, educators, graduate students, researchers, policy makers and those interested to reform education and teacher education in the new century.",
      "thumbnail": "http://books.google.com/books/content?id=tgjLXo5xj_4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=tgjLXo5xj_4C&pg=PA9&dq=technology+insubject&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "zy5VEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/zy5VEAAAQBAJ",
      "title": "Medical Informatics and Bioimaging Using Artificial Intelligence",
      "author": "Aboul Ella Hassanien",
      "category": "technology",
      "description": "Challenges, Issues, Innovations and Recent Developments",
      "thumbnail": "http://books.google.com/books/content?id=zy5VEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=zy5VEAAAQBAJ&pg=PA77&dq=technology+insubject&hl=&cd=5&source=gbs_api"
    },
    {
      "id": "0AgpEAAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/0AgpEAAAQBAJ",
      "title": "Spatial Multimedia and Virtual Reality",
      "author": "Antonio S. Camara",
      "category": "technology",
      "description": "The intersection of two disciplines and technologies which have become mature academic research topics in the 1990s was destined to be a dynamic area for collaboration and publication. However, until now no significant book-length treatment of the meeting of GIS and Virtual Reality has been available. This volume puts that situation to rights by bringing these together to cement some common understanding and principles in a potentially highly promising area for technological collaboration and cross-fertilisation. The result is a volume which ranges in subject matter from studies of a Virtual GIS Room to Spatial Agents, and from an Environmental Multimedia System to Computer-Assisted 3D Geographic Education. All the contributors are well-known international scientists, principally from the computational side of GIS. It will be a valuable resource for any GIS researcher or professional looking to understand the leading edge of this fertile field.",
      "thumbnail": "http://books.google.com/books/content?id=0AgpEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=0AgpEAAAQBAJ&printsec=frontcover&dq=technology+insubject&hl=&cd=8&source=gbs_api"
    },
    {
      "id": "UH4OzgEACAAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/UH4OzgEACAAJ",
      "title": "Computational Intelligence and Biomedical Signal Processing",
      "author": "Mitul Kumar Ahirwal",
      "category": "technology",
      "description": "This book presents an interdisciplinary paradigms of computational intelligence techniques and biomedical signal processing. The computational intelligence techniques outlined in the book will help to develop various ways to enhance and utilize signal processing algorithms in the field of biomedical signal processing. In this book, authors have discussed research, discoveries and innovations in computational intelligence, signal processing, and biomedical engineering that will be beneficial to engineers working in the field of health care systems. The book provides fundamental and initial level theory and implementation tools, so that readers can quickly start their research in these interdisciplinary domains.",
      "thumbnail": "http://books.google.com/books/content?id=UH4OzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=UH4OzgEACAAJ&dq=technology+insubject&hl=&cd=9&source=gbs_api"
    },
    {
      "id": "xtDaDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/xtDaDwAAQBAJ",
      "title": "IoT Technologies for HealthCare",
      "author": "Nuno M. Garcia",
      "category": "technology",
      "description": "This book constitutes the proceedings of the 6th International Conference on Internet of Things (IoT) Technologies for HealthCare, HealthyIoT 2019, held in Braga, Portugal, in December 2019. The IoT as a set of existing and emerging technologies, notions and services can provide many solutions to delivery of electronic healthcare, patient care, and medical data management. The 10 revised full papers presented were carefully reviewed and selected from 26 submissions. The papers cover topics such as healthcare information systems, consumer health, health informatics, engineering, telecommunications, mathematics and statistics, life and medical sciences, and cloud computing.",
      "thumbnail": "http://books.google.com/books/content?id=xtDaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=xtDaDwAAQBAJ&pg=PA31&dq=technology+insubject&hl=&cd=20&source=gbs_api"
    },
    {
      "id": "2GTTDwAAQBAJ",
      "selfLink": "https://www.googleapis.com/books/v1/volumes/2GTTDwAAQBAJ",
      "title": "Converting STEM into STEAM Programs",
      "author": "Arthur J. Stewart",
      "category": "technology",
      "description": "This book examines the push and pull of factors contributing to and constraining conversion of STEM (science, technology, engineering and math) education programs into STEAM (science, technology, engineering, math and arts) education programs. The chapters in this book offer thought-provoking examples, theory, and suggestions about the advantages, methods and challenges involved in making STEM to STEAM conversions, at levels ranging from K12 through graduate university programs. A large driving force for STEM-to-STEAM conversions is the emerging awareness that the scientific workforce finds itself less than ideally prepared when engaging with so-called ‘wicked problems’ – the complex suite of emerging, multifaceted issues such as global climate change, social injustice, and pandemic diseases. Dealing with these issues requires cross-disciplinary expertise and the ability to insert technical and scientific understanding effectively into areas of public planning and policy. The different models and possibilities for STEAM, as the next phase of the STEM revolution, laid out in this book will promote research and further our understanding of STEAM as a forward-thinking approach to education. Gillian Roehrig, STEM Education, University of Minnesota, USA The ideal teacher sees opportunities for integrating ideas from multiple disciplines into every lesson. This book offers many worthwhile suggestions on how to do that deliberately and systematically George DeBoer, Project 2061 of the American Association for the Advancement of Science, USA For the last several years, calls for expanding STEM education have grown, but so too have concerns about technocratic approaches to STEM. This volume challenges the community to consider broader views on STEM by focusing on the place of arts education within this movement. The chapters offer much needed, new perspectives on the (re)integration of the arts and sciences Troy Sadler, School of Education, University of North Carolina, USA",
      "thumbnail": "http://books.google.com/books/content?id=2GTTDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
      "downloadLink": null,
      "previewLink": "http://books.google.com.eg/books?id=2GTTDwAAQBAJ&pg=PA246&dq=technology+insubject&hl=&cd=23&source=gbs_api"
    }

  ]
}